HloModule a_inference__lambda__4403__.6, entry_computation_layout={(f32[1,224,224,3]{3,2,1,0}, f32[7,7,3,64]{3,2,1,0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, /*index=5*/f32[64]{0}, f32[64]{0}, f32[1,1,64,64]{3,2,1,0}, f32[64]{0}, f32[64]{0}, /*index=10*/f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[3,3,64,64]{3,2,1,0}, f32[64]{0}, /*index=15*/f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[1,1,64,256]{3,2,1,0}, /*index=20*/f32[256]{0}, f32[1,1,64,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=25*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=30*/f32[256]{0}, f32[1,1,256,64]{3,2,1,0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, /*index=35*/f32[64]{0}, f32[64]{0}, f32[3,3,64,64]{3,2,1,0}, f32[64]{0}, f32[64]{0}, /*index=40*/f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[1,1,64,256]{3,2,1,0}, f32[256]{0}, /*index=45*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[1,1,256,64]{3,2,1,0}, /*index=50*/f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, /*index=55*/f32[3,3,64,64]{3,2,1,0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, f32[64]{0}, /*index=60*/f32[64]{0}, f32[1,1,64,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=65*/f32[256]{0}, f32[256]{0}, f32[1,1,256,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, /*index=70*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[3,3,128,128]{3,2,1,0}, f32[128]{0}, /*index=75*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[1,1,128,512]{3,2,1,0}, /*index=80*/f32[512]{0}, f32[1,1,256,512]{3,2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=85*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=90*/f32[512]{0}, f32[1,1,512,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, /*index=95*/f32[128]{0}, f32[128]{0}, f32[3,3,128,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, /*index=100*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[1,1,128,512]{3,2,1,0}, f32[512]{0}, /*index=105*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[1,1,512,128]{3,2,1,0}, /*index=110*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, /*index=115*/f32[3,3,128,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, /*index=120*/f32[128]{0}, f32[1,1,128,512]{3,2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=125*/f32[512]{0}, f32[512]{0}, f32[1,1,512,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, /*index=130*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[3,3,128,128]{3,2,1,0}, f32[128]{0}, /*index=135*/f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[1,1,128,512]{3,2,1,0}, /*index=140*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=145*/f32[1,1,512,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=150*/f32[256]{0}, f32[3,3,256,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=155*/f32[256]{0}, f32[256]{0}, f32[1,1,256,1024]{3,2,1,0}, f32[1024]{0}, f32[1,1,512,1024]{3,2,1,0}, /*index=160*/f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, /*index=165*/f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1,1,1024,256]{3,2,1,0}, /*index=170*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=175*/f32[3,3,256,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=180*/f32[256]{0}, f32[1,1,256,1024]{3,2,1,0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, /*index=185*/f32[1024]{0}, f32[1024]{0}, f32[1,1,1024,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, /*index=190*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[3,3,256,256]{3,2,1,0}, f32[256]{0}, /*index=195*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[1,1,256,1024]{3,2,1,0}, /*index=200*/f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, /*index=205*/f32[1,1,1024,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=210*/f32[256]{0}, f32[3,3,256,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=215*/f32[256]{0}, f32[256]{0}, f32[1,1,256,1024]{3,2,1,0}, f32[1024]{0}, f32[1024]{0}, /*index=220*/f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1,1,1024,256]{3,2,1,0}, f32[256]{0}, /*index=225*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[3,3,256,256]{3,2,1,0}, /*index=230*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=235*/f32[1,1,256,1024]{3,2,1,0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, /*index=240*/f32[1024]{0}, f32[1,1,1024,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=245*/f32[256]{0}, f32[256]{0}, f32[3,3,256,256]{3,2,1,0}, f32[256]{0}, f32[256]{0}, /*index=250*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[1,1,256,1024]{3,2,1,0}, f32[1024]{0}, /*index=255*/f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1024]{0}, f32[1,1,1024,512]{3,2,1,0}, /*index=260*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=265*/f32[3,3,512,512]{3,2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=270*/f32[512]{0}, f32[1,1,512,2048]{3,2,1,0}, f32[2048]{0}, f32[1,1,1024,2048]{3,2,1,0}, f32[2048]{0}, /*index=275*/f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, /*index=280*/f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[1,1,2048,512]{3,2,1,0}, f32[512]{0}, /*index=285*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[3,3,512,512]{3,2,1,0}, /*index=290*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=295*/f32[1,1,512,2048]{3,2,1,0}, f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, /*index=300*/f32[2048]{0}, f32[1,1,2048,512]{3,2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=305*/f32[512]{0}, f32[512]{0}, f32[3,3,512,512]{3,2,1,0}, f32[512]{0}, f32[512]{0}, /*index=310*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[1,1,512,2048]{3,2,1,0}, f32[2048]{0}, /*index=315*/f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[2048]{0}, f32[2048,1000]{1,0}, /*index=320*/f32[1000]{0})->f32[1,1000]{1,0}}

%max_F32.2 (lhs.2: f32[], rhs.2: f32[]) -> f32[] {
  %lhs.2 = f32[] parameter(0)
  %rhs.2 = f32[] parameter(1)
  ROOT %maximum.2 = f32[] maximum(f32[] %lhs.2, f32[] %rhs.2)
}

%resnet50_1_avg_pool_1_Mean-reduction.3 (x.1: f32[], y.1: f32[]) -> f32[] {
  %x.1 = f32[] parameter(0)
  %y.1 = f32[] parameter(1)
  ROOT %add.159 = f32[] add(f32[] %x.1, f32[] %y.1)
}

%region_0.4 (Softmax.5: f32[], Softmax.6: f32[]) -> f32[] {
  %Softmax.5 = f32[] parameter(0), metadata={op_name="resnet50_1/predictions_1/Softmax"}
  %Softmax.6 = f32[] parameter(1), metadata={op_name="resnet50_1/predictions_1/Softmax"}
  ROOT %Softmax.7 = f32[] maximum(f32[] %Softmax.5, f32[] %Softmax.6), metadata={op_type="Softmax" op_name="resnet50_1/predictions_1/Softmax"}
}

%region_1.5 (Softmax.18: f32[], Softmax.19: f32[]) -> f32[] {
  %Softmax.18 = f32[] parameter(0), metadata={op_name="resnet50_1/predictions_1/Softmax"}
  %Softmax.19 = f32[] parameter(1), metadata={op_name="resnet50_1/predictions_1/Softmax"}
  ROOT %Softmax.20 = f32[] add(f32[] %Softmax.18, f32[] %Softmax.19), metadata={op_type="Softmax" op_name="resnet50_1/predictions_1/Softmax"}
}

ENTRY %a_inference__lambda__4403__.6 (arg0.1: f32[1,224,224,3], arg1.1: f32[7,7,3,64], arg2.1: f32[64], arg3.1: f32[64], arg4.1: f32[64], arg5.1: f32[64], arg6.1: f32[64], arg7.1: f32[1,1,64,64], arg8.1: f32[64], arg9.1: f32[64], arg10.1: f32[64], arg11.1: f32[64], arg12.1: f32[64], arg13.1: f32[3,3,64,64], arg14.1: f32[64], arg15.1: f32[64], arg16.1: f32[64], arg17.1: f32[64], arg18.1: f32[64], arg19.1: f32[1,1,64,256], arg20.1: f32[256], arg21.1: f32[1,1,64,256], arg22.1: f32[256], arg23.1: f32[256], arg24.1: f32[256], arg25.1: f32[256], arg26.1: f32[256], arg27.1: f32[256], arg28.1: f32[256], arg29.1: f32[256], arg30.1: f32[256], arg31.1: f32[1,1,256,64], arg32.1: f32[64], arg33.1: f32[64], arg34.1: f32[64], arg35.1: f32[64], arg36.1: f32[64], arg37.1: f32[3,3,64,64], arg38.1: f32[64], arg39.1: f32[64], arg40.1: f32[64], arg41.1: f32[64], arg42.1: f32[64], arg43.1: f32[1,1,64,256], arg44.1: f32[256], arg45.1: f32[256], arg46.1: f32[256], arg47.1: f32[256], arg48.1: f32[256], arg49.1: f32[1,1,256,64], arg50.1: f32[64], arg51.1: f32[64], arg52.1: f32[64], arg53.1: f32[64], arg54.1: f32[64], arg55.1: f32[3,3,64,64], arg56.1: f32[64], arg57.1: f32[64], arg58.1: f32[64], arg59.1: f32[64], arg60.1: f32[64], arg61.1: f32[1,1,64,256], arg62.1: f32[256], arg63.1: f32[256], arg64.1: f32[256], arg65.1: f32[256], arg66.1: f32[256], arg67.1: f32[1,1,256,128], arg68.1: f32[128], arg69.1: f32[128], arg70.1: f32[128], arg71.1: f32[128], arg72.1: f32[128], arg73.1: f32[3,3,128,128], arg74.1: f32[128], arg75.1: f32[128], arg76.1: f32[128], arg77.1: f32[128], arg78.1: f32[128], arg79.1: f32[1,1,128,512], arg80.1: f32[512], arg81.1: f32[1,1,256,512], arg82.1: f32[512], arg83.1: f32[512], arg84.1: f32[512], arg85.1: f32[512], arg86.1: f32[512], arg87.1: f32[512], arg88.1: f32[512], arg89.1: f32[512], arg90.1: f32[512], arg91.1: f32[1,1,512,128], arg92.1: f32[128], arg93.1: f32[128], arg94.1: f32[128], arg95.1: f32[128], arg96.1: f32[128], arg97.1: f32[3,3,128,128], arg98.1: f32[128], arg99.1: f32[128], arg100.1: f32[128], arg101.1: f32[128], arg102.1: f32[128], arg103.1: f32[1,1,128,512], arg104.1: f32[512], arg105.1: f32[512], arg106.1: f32[512], arg107.1: f32[512], arg108.1: f32[512], arg109.1: f32[1,1,512,128], arg110.1: f32[128], arg111.1: f32[128], arg112.1: f32[128], arg113.1: f32[128], arg114.1: f32[128], arg115.1: f32[3,3,128,128], arg116.1: f32[128], arg117.1: f32[128], arg118.1: f32[128], arg119.1: f32[128], arg120.1: f32[128], arg121.1: f32[1,1,128,512], arg122.1: f32[512], arg123.1: f32[512], arg124.1: f32[512], arg125.1: f32[512], arg126.1: f32[512], arg127.1: f32[1,1,512,128], arg128.1: f32[128], arg129.1: f32[128], arg130.1: f32[128], arg131.1: f32[128], arg132.1: f32[128], arg133.1: f32[3,3,128,128], arg134.1: f32[128], arg135.1: f32[128], arg136.1: f32[128], arg137.1: f32[128], arg138.1: f32[128], arg139.1: f32[1,1,128,512], arg140.1: f32[512], arg141.1: f32[512], arg142.1: f32[512], arg143.1: f32[512], arg144.1: f32[512], arg145.1: f32[1,1,512,256], arg146.1: f32[256], arg147.1: f32[256], arg148.1: f32[256], arg149.1: f32[256], arg150.1: f32[256], arg151.1: f32[3,3,256,256], arg152.1: f32[256], arg153.1: f32[256], arg154.1: f32[256], arg155.1: f32[256], arg156.1: f32[256], arg157.1: f32[1,1,256,1024], arg158.1: f32[1024], arg159.1: f32[1,1,512,1024], arg160.1: f32[1024], arg161.1: f32[1024], arg162.1: f32[1024], arg163.1: f32[1024], arg164.1: f32[1024], arg165.1: f32[1024], arg166.1: f32[1024], arg167.1: f32[1024], arg168.1: f32[1024], arg169.1: f32[1,1,1024,256], arg170.1: f32[256], arg171.1: f32[256], arg172.1: f32[256], arg173.1: f32[256], arg174.1: f32[256], arg175.1: f32[3,3,256,256], arg176.1: f32[256], arg177.1: f32[256], arg178.1: f32[256], arg179.1: f32[256], arg180.1: f32[256], arg181.1: f32[1,1,256,1024], arg182.1: f32[1024], arg183.1: f32[1024], arg184.1: f32[1024], arg185.1: f32[1024], arg186.1: f32[1024], arg187.1: f32[1,1,1024,256], arg188.1: f32[256], arg189.1: f32[256], arg190.1: f32[256], arg191.1: f32[256], arg192.1: f32[256], arg193.1: f32[3,3,256,256], arg194.1: f32[256], arg195.1: f32[256], arg196.1: f32[256], arg197.1: f32[256], arg198.1: f32[256], arg199.1: f32[1,1,256,1024], arg200.1: f32[1024], arg201.1: f32[1024], arg202.1: f32[1024], arg203.1: f32[1024], arg204.1: f32[1024], arg205.1: f32[1,1,1024,256], arg206.1: f32[256], arg207.1: f32[256], arg208.1: f32[256], arg209.1: f32[256], arg210.1: f32[256], arg211.1: f32[3,3,256,256], arg212.1: f32[256], arg213.1: f32[256], arg214.1: f32[256], arg215.1: f32[256], arg216.1: f32[256], arg217.1: f32[1,1,256,1024], arg218.1: f32[1024], arg219.1: f32[1024], arg220.1: f32[1024], arg221.1: f32[1024], arg222.1: f32[1024], arg223.1: f32[1,1,1024,256], arg224.1: f32[256], arg225.1: f32[256], arg226.1: f32[256], arg227.1: f32[256], arg228.1: f32[256], arg229.1: f32[3,3,256,256], arg230.1: f32[256], arg231.1: f32[256], arg232.1: f32[256], arg233.1: f32[256], arg234.1: f32[256], arg235.1: f32[1,1,256,1024], arg236.1: f32[1024], arg237.1: f32[1024], arg238.1: f32[1024], arg239.1: f32[1024], arg240.1: f32[1024], arg241.1: f32[1,1,1024,256], arg242.1: f32[256], arg243.1: f32[256], arg244.1: f32[256], arg245.1: f32[256], arg246.1: f32[256], arg247.1: f32[3,3,256,256], arg248.1: f32[256], arg249.1: f32[256], arg250.1: f32[256], arg251.1: f32[256], arg252.1: f32[256], arg253.1: f32[1,1,256,1024], arg254.1: f32[1024], arg255.1: f32[1024], arg256.1: f32[1024], arg257.1: f32[1024], arg258.1: f32[1024], arg259.1: f32[1,1,1024,512], arg260.1: f32[512], arg261.1: f32[512], arg262.1: f32[512], arg263.1: f32[512], arg264.1: f32[512], arg265.1: f32[3,3,512,512], arg266.1: f32[512], arg267.1: f32[512], arg268.1: f32[512], arg269.1: f32[512], arg270.1: f32[512], arg271.1: f32[1,1,512,2048], arg272.1: f32[2048], arg273.1: f32[1,1,1024,2048], arg274.1: f32[2048], arg275.1: f32[2048], arg276.1: f32[2048], arg277.1: f32[2048], arg278.1: f32[2048], arg279.1: f32[2048], arg280.1: f32[2048], arg281.1: f32[2048], arg282.1: f32[2048], arg283.1: f32[1,1,2048,512], arg284.1: f32[512], arg285.1: f32[512], arg286.1: f32[512], arg287.1: f32[512], arg288.1: f32[512], arg289.1: f32[3,3,512,512], arg290.1: f32[512], arg291.1: f32[512], arg292.1: f32[512], arg293.1: f32[512], arg294.1: f32[512], arg295.1: f32[1,1,512,2048], arg296.1: f32[2048], arg297.1: f32[2048], arg298.1: f32[2048], arg299.1: f32[2048], arg300.1: f32[2048], arg301.1: f32[1,1,2048,512], arg302.1: f32[512], arg303.1: f32[512], arg304.1: f32[512], arg305.1: f32[512], arg306.1: f32[512], arg307.1: f32[3,3,512,512], arg308.1: f32[512], arg309.1: f32[512], arg310.1: f32[512], arg311.1: f32[512], arg312.1: f32[512], arg313.1: f32[1,1,512,2048], arg314.1: f32[2048], arg315.1: f32[2048], arg316.1: f32[2048], arg317.1: f32[2048], arg318.1: f32[2048], arg319.1: f32[2048,1000], arg320.1: f32[1000]) -> f32[1,1000] {
  %arg0.1 = f32[1,224,224,3]{3,2,1,0} parameter(0), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.1 = f32[1,224,224,3]{3,2,1,0} reshape(f32[1,224,224,3]{3,2,1,0} %arg0.1)
  %Pad.4 = f32[] constant(0), metadata={op_type="Pad" op_name="resnet50_1/conv1_pad_1/Pad" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Pad.5 = f32[1,230,230,3]{3,2,1,0} pad(f32[1,224,224,3]{3,2,1,0} %reshape.1, f32[] %Pad.4), padding=0_0x3_3x3_3x0_0, metadata={op_type="Pad" op_name="resnet50_1/conv1_pad_1/Pad" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg1.1 = f32[7,7,3,64]{3,2,1,0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.53 = f32[1,112,112,64]{3,2,1,0} convolution(f32[1,230,230,3]{3,2,1,0} %Pad.5, f32[7,7,3,64]{3,2,1,0} %arg1.1), window={size=7x7 stride=2x2}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="resnet50_1/conv1_conv_1/convolution" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg2.1 = f32[64]{0} parameter(2), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.107 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg2.1), metadata={op_type="Reshape" op_name="resnet50_1/conv1_conv_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Squeeze.53 = f32[64]{0} reshape(f32[1,1,1,64]{3,2,1,0} %Reshape.107), metadata={op_type="Squeeze" op_name="resnet50_1/conv1_conv_1/Squeeze" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.108 = f32[1,112,112,64]{3,2,1,0} broadcast(f32[64]{0} %Squeeze.53), dimensions={3}, metadata={op_type="BiasAdd" op_name="resnet50_1/conv1_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.109 = f32[1,112,112,64]{3,2,1,0} add(f32[1,112,112,64]{3,2,1,0} %convolution.53, f32[1,112,112,64]{3,2,1,0} %BiasAdd.108), metadata={op_type="BiasAdd" op_name="resnet50_1/conv1_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg4.1 = f32[64]{0} parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_1.53 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg4.1), metadata={op_type="Reshape" op_name="resnet50_1/conv1_bn_1/Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.160 = f32[] constant(1.001e-05), metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.161 = f32[1,1,1,64]{3,2,1,0} broadcast(f32[] %add.160), dimensions={}, metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.162 = f32[1,1,1,64]{3,2,1,0} add(f32[1,1,1,64]{3,2,1,0} %Reshape_1.53, f32[1,1,1,64]{3,2,1,0} %add.161), metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.53 = f32[1,1,1,64]{3,2,1,0} rsqrt(f32[1,1,1,64]{3,2,1,0} %add.162), metadata={op_type="Rsqrt" op_name="resnet50_1/conv1_bn_1/batchnorm/Rsqrt"}
  %arg5.1 = f32[64]{0} parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_3.53 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg5.1), metadata={op_type="Reshape" op_name="resnet50_1/conv1_bn_1/Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.53 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Rsqrt.53, f32[1,1,1,64]{3,2,1,0} %Reshape_3.53), metadata={op_type="Mul" op_name="resnet50_1/conv1_bn_1/batchnorm/mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.159 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %mul.53), metadata={op_type="Mul" op_name="resnet50_1/conv1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.160 = f32[1,112,112,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %mul_1.159), dimensions={0,3}, metadata={op_type="Mul" op_name="resnet50_1/conv1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.161 = f32[1,112,112,64]{3,2,1,0} multiply(f32[1,112,112,64]{3,2,1,0} %BiasAdd.109, f32[1,112,112,64]{3,2,1,0} %mul_1.160), metadata={op_type="Mul" op_name="resnet50_1/conv1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg6.1 = f32[64]{0} parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_2.53 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg6.1), metadata={op_type="Reshape" op_name="resnet50_1/conv1_bn_1/Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg3.1 = f32[64]{0} parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.106 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg3.1), metadata={op_type="Reshape" op_name="resnet50_1/conv1_bn_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.53 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Reshape.106, f32[1,1,1,64]{3,2,1,0} %mul.53), metadata={op_type="Mul" op_name="resnet50_1/conv1_bn_1/batchnorm/mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.53 = f32[1,1,1,64]{3,2,1,0} subtract(f32[1,1,1,64]{3,2,1,0} %Reshape_2.53, f32[1,1,1,64]{3,2,1,0} %mul_2.53), metadata={op_type="Sub" op_name="resnet50_1/conv1_bn_1/batchnorm/sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.159 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %sub.53), metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.160 = f32[1,112,112,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %add_1.159), dimensions={0,3}, metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.161 = f32[1,112,112,64]{3,2,1,0} add(f32[1,112,112,64]{3,2,1,0} %mul_1.161, f32[1,112,112,64]{3,2,1,0} %add_1.160), metadata={op_type="AddV2" op_name="resnet50_1/conv1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.147 = f32[] constant(0), metadata={op_type="Relu" op_name="resnet50_1/conv1_relu_1/Relu" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.148 = f32[1,112,112,64]{3,2,1,0} broadcast(f32[] %Relu.147), dimensions={}, metadata={op_type="Relu" op_name="resnet50_1/conv1_relu_1/Relu"}
  %Relu.149 = f32[1,112,112,64]{3,2,1,0} maximum(f32[1,112,112,64]{3,2,1,0} %add_1.161, f32[1,112,112,64]{3,2,1,0} %Relu.148), metadata={op_type="Relu" op_name="resnet50_1/conv1_relu_1/Relu"}
  %Pad.6 = f32[] constant(0), metadata={op_type="Pad" op_name="resnet50_1/pool1_pad_1/Pad" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Pad.7 = f32[1,114,114,64]{3,2,1,0} pad(f32[1,112,112,64]{3,2,1,0} %Relu.149, f32[] %Pad.6), padding=0_0x1_1x1_1x0_0, metadata={op_type="Pad" op_name="resnet50_1/pool1_pad_1/Pad" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MaxPool2d.2 = f32[] constant(-inf), metadata={op_type="MaxPool" op_name="resnet50_1/pool1_pool_1/MaxPool2d" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MaxPool2d.3 = f32[1,56,56,64]{3,2,1,0} reduce-window(f32[1,114,114,64]{3,2,1,0} %Pad.7, f32[] %MaxPool2d.2), window={size=1x3x3x1 stride=1x2x2x1}, to_apply=%max_F32.2, metadata={op_type="MaxPool" op_name="resnet50_1/pool1_pool_1/MaxPool2d" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg21.1 = f32[1,1,64,256]{3,2,1,0} parameter(21), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.54 = f32[1,56,56,256]{3,2,1,0} convolution(f32[1,56,56,64]{3,2,1,0} %MaxPool2d.3, f32[1,1,64,256]{3,2,1,0} %arg21.1), window={size=1x1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="resnet50_1/conv2_block1_0_conv_1/convolution" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg22.1 = f32[256]{0} parameter(22), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.109 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg22.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_0_conv_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Squeeze.54 = f32[256]{0} reshape(f32[1,1,1,256]{3,2,1,0} %Reshape.109), metadata={op_type="Squeeze" op_name="resnet50_1/conv2_block1_0_conv_1/Squeeze" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.110 = f32[1,56,56,256]{3,2,1,0} broadcast(f32[256]{0} %Squeeze.54), dimensions={3}, metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_0_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.111 = f32[1,56,56,256]{3,2,1,0} add(f32[1,56,56,256]{3,2,1,0} %convolution.54, f32[1,56,56,256]{3,2,1,0} %BiasAdd.110), metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_0_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg24.1 = f32[256]{0} parameter(24), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_1.54 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg24.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_0_bn_1/Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.163 = f32[] constant(1.001e-05), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.164 = f32[1,1,1,256]{3,2,1,0} broadcast(f32[] %add.163), dimensions={}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.165 = f32[1,1,1,256]{3,2,1,0} add(f32[1,1,1,256]{3,2,1,0} %Reshape_1.54, f32[1,1,1,256]{3,2,1,0} %add.164), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.54 = f32[1,1,1,256]{3,2,1,0} rsqrt(f32[1,1,1,256]{3,2,1,0} %add.165), metadata={op_type="Rsqrt" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/Rsqrt"}
  %arg25.1 = f32[256]{0} parameter(25), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_3.54 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg25.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_0_bn_1/Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.54 = f32[1,1,1,256]{3,2,1,0} multiply(f32[1,1,1,256]{3,2,1,0} %Rsqrt.54, f32[1,1,1,256]{3,2,1,0} %Reshape_3.54), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.162 = f32[1,256]{1,0} reshape(f32[1,1,1,256]{3,2,1,0} %mul.54), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.163 = f32[1,56,56,256]{3,2,1,0} broadcast(f32[1,256]{1,0} %mul_1.162), dimensions={0,3}, metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.164 = f32[1,56,56,256]{3,2,1,0} multiply(f32[1,56,56,256]{3,2,1,0} %BiasAdd.111, f32[1,56,56,256]{3,2,1,0} %mul_1.163), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg26.1 = f32[256]{0} parameter(26), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_2.54 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg26.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_0_bn_1/Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg23.1 = f32[256]{0} parameter(23), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.108 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg23.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_0_bn_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.54 = f32[1,1,1,256]{3,2,1,0} multiply(f32[1,1,1,256]{3,2,1,0} %Reshape.108, f32[1,1,1,256]{3,2,1,0} %mul.54), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.54 = f32[1,1,1,256]{3,2,1,0} subtract(f32[1,1,1,256]{3,2,1,0} %Reshape_2.54, f32[1,1,1,256]{3,2,1,0} %mul_2.54), metadata={op_type="Sub" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.162 = f32[1,256]{1,0} reshape(f32[1,1,1,256]{3,2,1,0} %sub.54), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.163 = f32[1,56,56,256]{3,2,1,0} broadcast(f32[1,256]{1,0} %add_1.162), dimensions={0,3}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.164 = f32[1,56,56,256]{3,2,1,0} add(f32[1,56,56,256]{3,2,1,0} %mul_1.164, f32[1,56,56,256]{3,2,1,0} %add_1.163), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_0_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg7.1 = f32[1,1,64,64]{3,2,1,0} parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.55 = f32[1,56,56,64]{3,2,1,0} convolution(f32[1,56,56,64]{3,2,1,0} %MaxPool2d.3, f32[1,1,64,64]{3,2,1,0} %arg7.1), window={size=1x1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="resnet50_1/conv2_block1_1_conv_1/convolution" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg8.1 = f32[64]{0} parameter(8), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.111 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg8.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_1_conv_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Squeeze.55 = f32[64]{0} reshape(f32[1,1,1,64]{3,2,1,0} %Reshape.111), metadata={op_type="Squeeze" op_name="resnet50_1/conv2_block1_1_conv_1/Squeeze" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.112 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[64]{0} %Squeeze.55), dimensions={3}, metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_1_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.113 = f32[1,56,56,64]{3,2,1,0} add(f32[1,56,56,64]{3,2,1,0} %convolution.55, f32[1,56,56,64]{3,2,1,0} %BiasAdd.112), metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_1_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg10.1 = f32[64]{0} parameter(10), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_1.55 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg10.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_1_bn_1/Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.166 = f32[] constant(1.001e-05), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.167 = f32[1,1,1,64]{3,2,1,0} broadcast(f32[] %add.166), dimensions={}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.168 = f32[1,1,1,64]{3,2,1,0} add(f32[1,1,1,64]{3,2,1,0} %Reshape_1.55, f32[1,1,1,64]{3,2,1,0} %add.167), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.55 = f32[1,1,1,64]{3,2,1,0} rsqrt(f32[1,1,1,64]{3,2,1,0} %add.168), metadata={op_type="Rsqrt" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/Rsqrt"}
  %arg11.1 = f32[64]{0} parameter(11), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_3.55 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg11.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_1_bn_1/Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.55 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Rsqrt.55, f32[1,1,1,64]{3,2,1,0} %Reshape_3.55), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.165 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %mul.55), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.166 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %mul_1.165), dimensions={0,3}, metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.167 = f32[1,56,56,64]{3,2,1,0} multiply(f32[1,56,56,64]{3,2,1,0} %BiasAdd.113, f32[1,56,56,64]{3,2,1,0} %mul_1.166), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg12.1 = f32[64]{0} parameter(12), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_2.55 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg12.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_1_bn_1/Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg9.1 = f32[64]{0} parameter(9), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.110 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg9.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_1_bn_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.55 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Reshape.110, f32[1,1,1,64]{3,2,1,0} %mul.55), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.55 = f32[1,1,1,64]{3,2,1,0} subtract(f32[1,1,1,64]{3,2,1,0} %Reshape_2.55, f32[1,1,1,64]{3,2,1,0} %mul_2.55), metadata={op_type="Sub" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.165 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %sub.55), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.166 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %add_1.165), dimensions={0,3}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.167 = f32[1,56,56,64]{3,2,1,0} add(f32[1,56,56,64]{3,2,1,0} %mul_1.167, f32[1,56,56,64]{3,2,1,0} %add_1.166), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_1_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.150 = f32[] constant(0), metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_1_relu_1/Relu" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.151 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[] %Relu.150), dimensions={}, metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_1_relu_1/Relu"}
  %Relu.152 = f32[1,56,56,64]{3,2,1,0} maximum(f32[1,56,56,64]{3,2,1,0} %add_1.167, f32[1,56,56,64]{3,2,1,0} %Relu.151), metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_1_relu_1/Relu"}
  %arg13.1 = f32[3,3,64,64]{3,2,1,0} parameter(13), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.56 = f32[1,56,56,64]{3,2,1,0} convolution(f32[1,56,56,64]{3,2,1,0} %Relu.152, f32[3,3,64,64]{3,2,1,0} %arg13.1), window={size=3x3 pad=1_1x1_1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="resnet50_1/conv2_block1_2_conv_1/convolution" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg14.1 = f32[64]{0} parameter(14), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.113 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg14.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_2_conv_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Squeeze.56 = f32[64]{0} reshape(f32[1,1,1,64]{3,2,1,0} %Reshape.113), metadata={op_type="Squeeze" op_name="resnet50_1/conv2_block1_2_conv_1/Squeeze" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.114 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[64]{0} %Squeeze.56), dimensions={3}, metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_2_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.115 = f32[1,56,56,64]{3,2,1,0} add(f32[1,56,56,64]{3,2,1,0} %convolution.56, f32[1,56,56,64]{3,2,1,0} %BiasAdd.114), metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_2_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg16.1 = f32[64]{0} parameter(16), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_1.56 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg16.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_2_bn_1/Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.169 = f32[] constant(1.001e-05), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.170 = f32[1,1,1,64]{3,2,1,0} broadcast(f32[] %add.169), dimensions={}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.171 = f32[1,1,1,64]{3,2,1,0} add(f32[1,1,1,64]{3,2,1,0} %Reshape_1.56, f32[1,1,1,64]{3,2,1,0} %add.170), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.56 = f32[1,1,1,64]{3,2,1,0} rsqrt(f32[1,1,1,64]{3,2,1,0} %add.171), metadata={op_type="Rsqrt" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/Rsqrt"}
  %arg17.1 = f32[64]{0} parameter(17), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_3.56 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg17.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_2_bn_1/Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.56 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Rsqrt.56, f32[1,1,1,64]{3,2,1,0} %Reshape_3.56), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.168 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %mul.56), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.169 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %mul_1.168), dimensions={0,3}, metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.170 = f32[1,56,56,64]{3,2,1,0} multiply(f32[1,56,56,64]{3,2,1,0} %BiasAdd.115, f32[1,56,56,64]{3,2,1,0} %mul_1.169), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg18.1 = f32[64]{0} parameter(18), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_2.56 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg18.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_2_bn_1/Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg15.1 = f32[64]{0} parameter(15), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.112 = f32[1,1,1,64]{3,2,1,0} reshape(f32[64]{0} %arg15.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_2_bn_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.56 = f32[1,1,1,64]{3,2,1,0} multiply(f32[1,1,1,64]{3,2,1,0} %Reshape.112, f32[1,1,1,64]{3,2,1,0} %mul.56), metadata={op_type="Mul" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.56 = f32[1,1,1,64]{3,2,1,0} subtract(f32[1,1,1,64]{3,2,1,0} %Reshape_2.56, f32[1,1,1,64]{3,2,1,0} %mul_2.56), metadata={op_type="Sub" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.168 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %sub.56), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.169 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %add_1.168), dimensions={0,3}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.170 = f32[1,56,56,64]{3,2,1,0} add(f32[1,56,56,64]{3,2,1,0} %mul_1.170, f32[1,56,56,64]{3,2,1,0} %add_1.169), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_2_bn_1/batchnorm/add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.153 = f32[] constant(0), metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_2_relu_1/Relu" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Relu.154 = f32[1,56,56,64]{3,2,1,0} broadcast(f32[] %Relu.153), dimensions={}, metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_2_relu_1/Relu"}
  %Relu.155 = f32[1,56,56,64]{3,2,1,0} maximum(f32[1,56,56,64]{3,2,1,0} %add_1.170, f32[1,56,56,64]{3,2,1,0} %Relu.154), metadata={op_type="Relu" op_name="resnet50_1/conv2_block1_2_relu_1/Relu"}
  %arg19.1 = f32[1,1,64,256]{3,2,1,0} parameter(19), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.57 = f32[1,56,56,256]{3,2,1,0} convolution(f32[1,56,56,64]{3,2,1,0} %Relu.155, f32[1,1,64,256]{3,2,1,0} %arg19.1), window={size=1x1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="resnet50_1/conv2_block1_3_conv_1/convolution" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg20.1 = f32[256]{0} parameter(20), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape.115 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg20.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_3_conv_1/Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Squeeze.57 = f32[256]{0} reshape(f32[1,1,1,256]{3,2,1,0} %Reshape.115), metadata={op_type="Squeeze" op_name="resnet50_1/conv2_block1_3_conv_1/Squeeze" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.116 = f32[1,56,56,256]{3,2,1,0} broadcast(f32[256]{0} %Squeeze.57), dimensions={3}, metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_3_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %BiasAdd.117 = f32[1,56,56,256]{3,2,1,0} add(f32[1,56,56,256]{3,2,1,0} %convolution.57, f32[1,56,56,256]{3,2,1,0} %BiasAdd.116), metadata={op_type="BiasAdd" op_name="resnet50_1/conv2_block1_3_conv_1/BiasAdd" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg28.1 = f32[256]{0} parameter(28), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %Reshape_1.57 = f32[1,1,1,256]{3,2,1,0} reshape(f32[256]{0} %arg28.1), metadata={op_type="Reshape" op_name="resnet50_1/conv2_block1_3_bn_1/Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.172 = f32[] constant(1.001e-05), metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_3_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.173 = f32[1,1,1,256]{3,2,1,0} broadcast(f32[] %add.172), dimensions={}, metadata={op_type="AddV2" op_name="resnet50_1/conv2_block1_3_bn_1/batchnorm/add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
