HloModule a_inference_sd_unet_tiny_236__.13, entry_computation_layout={(f32[1,8,8,4]{3,2,1,0}, f32[1,128]{1,0}, f32[1,8,64]{2,1,0}, f32[3,3,4,64]{3,2,1,0}, f32[64]{0}, /*index=5*/f32[64]{0}, f32[128,64]{1,0}, f32[3,3,64,128]{3,2,1,0}, f32[128]{0}, f32[128]{0}, /*index=10*/f32[128,128]{1,0}, f32[128,128]{1,0}, f32[128,128]{1,0}, f32[128,128]{1,0}, f32[64,128]{1,0}, /*index=15*/f32[128,128]{1,0}, f32[128]{0}, f32[128]{0}, f32[3,3,256,64]{3,2,1,0}, f32[64]{0}, /*index=20*/f32[64]{0}, f32[3,3,64,4]{3,2,1,0})->f32[1,8,8,4]{3,2,1,0}}

%Mean-reduction.1 (x.1: f32[], y.1: f32[]) -> f32[] {
  %x.1 = f32[] parameter(0)
  %y.1 = f32[] parameter(1)
  ROOT %add.1 = f32[] add(f32[] %x.1, f32[] %y.1)
}

%Mean_1-reduction.2 (x.0: f32[], y.0: f32[]) -> f32[] {
  %x.0 = f32[] parameter(0)
  %y.0 = f32[] parameter(1)
  ROOT %add.0 = f32[] add(f32[] %x.0, f32[] %y.0)
}

%Mean_2-reduction.3 (x.2: f32[], y.2: f32[]) -> f32[] {
  %x.2 = f32[] parameter(0)
  %y.2 = f32[] parameter(1)
  ROOT %add.5 = f32[] add(f32[] %x.2, f32[] %y.2)
}

%Mean_3-reduction.4 (x.3: f32[], y.3: f32[]) -> f32[] {
  %x.3 = f32[] parameter(0)
  %y.3 = f32[] parameter(1)
  ROOT %add.6 = f32[] add(f32[] %x.3, f32[] %y.3)
}

%Mean_4-reduction.5 (x.4: f32[], y.4: f32[]) -> f32[] {
  %x.4 = f32[] parameter(0)
  %y.4 = f32[] parameter(1)
  ROOT %add.7 = f32[] add(f32[] %x.4, f32[] %y.4)
}

%Mean_5-reduction.6 (x.5: f32[], y.5: f32[]) -> f32[] {
  %x.5 = f32[] parameter(0)
  %y.5 = f32[] parameter(1)
  ROOT %add.8 = f32[] add(f32[] %x.5, f32[] %y.5)
}

%region_0.7 (Softmax.5: f32[], Softmax.6: f32[]) -> f32[] {
  %Softmax.5 = f32[] parameter(0), metadata={op_name="Softmax"}
  %Softmax.6 = f32[] parameter(1), metadata={op_name="Softmax"}
  ROOT %Softmax.7 = f32[] maximum(f32[] %Softmax.5, f32[] %Softmax.6), metadata={op_type="Softmax" op_name="Softmax"}
}

%region_1.8 (Softmax.18: f32[], Softmax.19: f32[]) -> f32[] {
  %Softmax.18 = f32[] parameter(0), metadata={op_name="Softmax"}
  %Softmax.19 = f32[] parameter(1), metadata={op_name="Softmax"}
  ROOT %Softmax.20 = f32[] add(f32[] %Softmax.18, f32[] %Softmax.19), metadata={op_type="Softmax" op_name="Softmax"}
}

%region_0.9 (Softmax_1.5: f32[], Softmax_1.6: f32[]) -> f32[] {
  %Softmax_1.5 = f32[] parameter(0), metadata={op_name="Softmax_1"}
  %Softmax_1.6 = f32[] parameter(1), metadata={op_name="Softmax_1"}
  ROOT %Softmax_1.7 = f32[] maximum(f32[] %Softmax_1.5, f32[] %Softmax_1.6), metadata={op_type="Softmax" op_name="Softmax_1"}
}

%region_1.10 (Softmax_1.18: f32[], Softmax_1.19: f32[]) -> f32[] {
  %Softmax_1.18 = f32[] parameter(0), metadata={op_name="Softmax_1"}
  %Softmax_1.19 = f32[] parameter(1), metadata={op_name="Softmax_1"}
  ROOT %Softmax_1.20 = f32[] add(f32[] %Softmax_1.18, f32[] %Softmax_1.19), metadata={op_type="Softmax" op_name="Softmax_1"}
}

%Mean_6-reduction.11 (x.6: f32[], y.6: f32[]) -> f32[] {
  %x.6 = f32[] parameter(0)
  %y.6 = f32[] parameter(1)
  ROOT %add.9 = f32[] add(f32[] %x.6, f32[] %y.6)
}

%Mean_7-reduction.12 (x.7: f32[], y.7: f32[]) -> f32[] {
  %x.7 = f32[] parameter(0)
  %y.7 = f32[] parameter(1)
  ROOT %add.10 = f32[] add(f32[] %x.7, f32[] %y.7)
}

ENTRY %a_inference_sd_unet_tiny_236__.13 (arg0.1: f32[1,8,8,4], arg1.1: f32[1,128], arg2.1: f32[1,8,64], arg3.1: f32[3,3,4,64], arg4.1: f32[64], arg5.1: f32[64], arg6.1: f32[128,64], arg7.1: f32[3,3,64,128], arg8.1: f32[128], arg9.1: f32[128], arg10.1: f32[128,128], arg11.1: f32[128,128], arg12.1: f32[128,128], arg13.1: f32[128,128], arg14.1: f32[64,128], arg15.1: f32[128,128], arg16.1: f32[128], arg17.1: f32[128], arg18.1: f32[3,3,256,64], arg19.1: f32[64], arg20.1: f32[64], arg21.1: f32[3,3,64,4]) -> f32[1,8,8,4] {
  %arg0.1 = f32[1,8,8,4]{3,2,1,0} parameter(0), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.22 = f32[1,8,8,4]{3,2,1,0} reshape(f32[1,8,8,4]{3,2,1,0} %arg0.1)
  %arg3.1 = f32[3,3,4,64]{3,2,1,0} parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.25 = f32[3,3,4,64]{3,2,1,0} reshape(f32[3,3,4,64]{3,2,1,0} %arg3.1)
  %Conv2D.1 = f32[1,8,8,64]{3,2,1,0} convolution(f32[1,8,8,4]{3,2,1,0} %reshape.22, f32[3,3,4,64]{3,2,1,0} %reshape.25), window={size=3x3 pad=1_1x1_1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="Conv2D" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape.1 = f32[1,8,8,4,16]{4,3,2,1,0} reshape(f32[1,8,8,64]{3,2,1,0} %Conv2D.1), metadata={op_type="Reshape" op_name="Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.14 = f32[1,8,8,4,16]{4,3,2,1,0} convert(f32[1,8,8,4,16]{4,3,2,1,0} %Reshape.1), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.16 = f32[] convert(f32[] %Mean.15), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,16]{4,3,2,1,0} %Mean.14, f32[] %Mean.16), dimensions={1,2,4}, to_apply=%Mean-reduction.1, metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.20 = s32[] multiply(s32[] %Mean.18, s32[] %Mean.19), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.21 = s32[] constant(16), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.22 = s32[] multiply(s32[] %Mean.20, s32[] %Mean.21), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.23 = f32[] convert(s32[] %Mean.22), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.24 = f32[1,4]{1,0} broadcast(f32[] %Mean.23), dimensions={}, metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean.17, f32[1,4]{1,0} %Mean.24), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean.25), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean.26), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean.27), metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.4 = f32[1,8,8,4,16]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub_1.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.5 = f32[1,8,8,4,16]{4,3,2,1,0} subtract(f32[1,8,8,4,16]{4,3,2,1,0} %Reshape.1, f32[1,8,8,4,16]{4,3,2,1,0} %sub_1.4), metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean.27), metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.4 = f32[1,8,8,4,16]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.5 = f32[1,8,8,4,16]{4,3,2,1,0} subtract(f32[1,8,8,4,16]{4,3,2,1,0} %Reshape.1, f32[1,8,8,4,16]{4,3,2,1,0} %sub.4), metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Square.1 = f32[1,8,8,4,16]{4,3,2,1,0} multiply(f32[1,8,8,4,16]{4,3,2,1,0} %sub.5, f32[1,8,8,4,16]{4,3,2,1,0} %sub.5), metadata={op_type="Square" op_name="Square" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.14 = f32[1,8,8,4,16]{4,3,2,1,0} convert(f32[1,8,8,4,16]{4,3,2,1,0} %Square.1), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.16 = f32[] convert(f32[] %Mean_1.15), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,16]{4,3,2,1,0} %Mean_1.14, f32[] %Mean_1.16), dimensions={1,2,4}, to_apply=%Mean_1-reduction.2, metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.20 = s32[] multiply(s32[] %Mean_1.18, s32[] %Mean_1.19), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.21 = s32[] constant(16), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.22 = s32[] multiply(s32[] %Mean_1.20, s32[] %Mean_1.21), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.23 = f32[] convert(s32[] %Mean_1.22), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.24 = f32[1,4]{1,0} broadcast(f32[] %Mean_1.23), dimensions={}, metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean_1.17, f32[1,4]{1,0} %Mean_1.24), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean_1.25), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean_1.26), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.11 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.12 = f32[1,1,1,4,1]{4,3,2,1,0} broadcast(f32[] %add.11), dimensions={}, metadata={op_type="AddV2" op_name="add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add.13 = f32[1,1,1,4,1]{4,3,2,1,0} add(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_1.27, f32[1,1,1,4,1]{4,3,2,1,0} %add.12), metadata={op_type="AddV2" op_name="add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.1 = f32[1,1,1,4,1]{4,3,2,1,0} rsqrt(f32[1,1,1,4,1]{4,3,2,1,0} %add.13), metadata={op_type="Rsqrt" op_name="Rsqrt"}
  %mul_1.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Rsqrt.1), metadata={op_type="Mul" op_name="mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.4 = f32[1,8,8,4,16]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %mul_1.3), dimensions={0,3}, metadata={op_type="Mul" op_name="mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.5 = f32[1,8,8,4,16]{4,3,2,1,0} multiply(f32[1,8,8,4,16]{4,3,2,1,0} %sub_1.5, f32[1,8,8,4,16]{4,3,2,1,0} %mul_1.4), metadata={op_type="Mul" op_name="mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_1.1 = f32[1,8,8,64]{3,2,1,0} reshape(f32[1,8,8,4,16]{4,3,2,1,0} %mul_1.5), metadata={op_type="Reshape" op_name="Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg4.1 = f32[64]{0} parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.26 = f32[64]{0} reshape(f32[64]{0} %arg4.1)
  %mul_2.2 = f32[1,8,8,64]{3,2,1,0} broadcast(f32[64]{0} %reshape.26), dimensions={3}, metadata={op_type="Mul" op_name="mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.3 = f32[1,8,8,64]{3,2,1,0} multiply(f32[1,8,8,64]{3,2,1,0} %Reshape_1.1, f32[1,8,8,64]{3,2,1,0} %mul_2.2), metadata={op_type="Mul" op_name="mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg5.1 = f32[64]{0} parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.27 = f32[64]{0} reshape(f32[64]{0} %arg5.1)
  %add_1.2 = f32[1,8,8,64]{3,2,1,0} broadcast(f32[64]{0} %reshape.27), dimensions={3}, metadata={op_type="AddV2" op_name="add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.3 = f32[1,8,8,64]{3,2,1,0} add(f32[1,8,8,64]{3,2,1,0} %mul_2.3, f32[1,8,8,64]{3,2,1,0} %add_1.2), metadata={op_type="AddV2" op_name="add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Sigmoid_1.1 = f32[1,8,8,64]{3,2,1,0} logistic(f32[1,8,8,64]{3,2,1,0} %add_1.3), metadata={op_type="Sigmoid" op_name="Sigmoid_1"}
  %mul_3.1 = f32[1,8,8,64]{3,2,1,0} multiply(f32[1,8,8,64]{3,2,1,0} %add_1.3, f32[1,8,8,64]{3,2,1,0} %Sigmoid_1.1), metadata={op_type="Mul" op_name="mul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg1.1 = f32[1,128]{1,0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.23 = f32[1,128]{1,0} reshape(f32[1,128]{1,0} %arg1.1)
  %strided_slice.2 = f32[1,64]{1,0} slice(f32[1,128]{1,0} %reshape.23), slice={[0:1], [0:64]}, metadata={op_type="StridedSlice" op_name="strided_slice" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %strided_slice.3 = f32[1,64]{1,0} reshape(f32[1,64]{1,0} %strided_slice.2), metadata={op_type="StridedSlice" op_name="strided_slice" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Sin.1 = f32[1,64]{1,0} sine(f32[1,64]{1,0} %strided_slice.3), metadata={op_type="Sin" op_name="Sin" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %strided_slice_1.2 = f32[1,64]{1,0} slice(f32[1,128]{1,0} %reshape.23), slice={[0:1], [64:128]}, metadata={op_type="StridedSlice" op_name="strided_slice_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %strided_slice_1.3 = f32[1,64]{1,0} reshape(f32[1,64]{1,0} %strided_slice_1.2), metadata={op_type="StridedSlice" op_name="strided_slice_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Cos.1 = f32[1,64]{1,0} cosine(f32[1,64]{1,0} %strided_slice_1.3), metadata={op_type="Cos" op_name="Cos"}
  %concat.1 = f32[1,128]{1,0} concatenate(f32[1,64]{1,0} %Sin.1, f32[1,64]{1,0} %Cos.1), dimensions={1}, metadata={op_type="ConcatV2" op_name="concat" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Sigmoid.1 = f32[1,128]{1,0} logistic(f32[1,128]{1,0} %concat.1), metadata={op_type="Sigmoid" op_name="Sigmoid"}
  %mul.1 = f32[1,128]{1,0} multiply(f32[1,128]{1,0} %concat.1, f32[1,128]{1,0} %Sigmoid.1), metadata={op_type="Mul" op_name="mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg6.1 = f32[128,64]{1,0} parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.28 = f32[128,64]{1,0} reshape(f32[128,64]{1,0} %arg6.1)
  %MatMul.2 = f32[1,64]{1,0} dot(f32[1,128]{1,0} %mul.1, f32[128,64]{1,0} %reshape.28), lhs_contracting_dims={1}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="MatMul" op_name="MatMul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul.3 = f32[1,64]{1,0} transpose(f32[1,64]{1,0} %MatMul.2), dimensions={0,1}, metadata={op_type="MatMul" op_name="MatMul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_2.1 = f32[1,1,1,64]{3,2,1,0} reshape(f32[1,64]{1,0} %MatMul.3), metadata={op_type="Reshape" op_name="Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_2.3 = f32[1,64]{1,0} reshape(f32[1,1,1,64]{3,2,1,0} %Reshape_2.1), metadata={op_type="AddV2" op_name="add_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_2.4 = f32[1,8,8,64]{3,2,1,0} broadcast(f32[1,64]{1,0} %add_2.3), dimensions={0,3}, metadata={op_type="AddV2" op_name="add_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_2.5 = f32[1,8,8,64]{3,2,1,0} add(f32[1,8,8,64]{3,2,1,0} %mul_3.1, f32[1,8,8,64]{3,2,1,0} %add_2.4), metadata={op_type="AddV2" op_name="add_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg7.1 = f32[3,3,64,128]{3,2,1,0} parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.29 = f32[3,3,64,128]{3,2,1,0} reshape(f32[3,3,64,128]{3,2,1,0} %arg7.1)
  %Conv2D_1.1 = f32[1,8,8,128]{3,2,1,0} convolution(f32[1,8,8,64]{3,2,1,0} %add_2.5, f32[3,3,64,128]{3,2,1,0} %reshape.29), window={size=3x3 pad=1_1x1_1}, dim_labels=b01f_01io->b01f, metadata={op_type="Conv2D" op_name="Conv2D_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_3.1 = f32[1,8,8,4,32]{4,3,2,1,0} reshape(f32[1,8,8,128]{3,2,1,0} %Conv2D_1.1), metadata={op_type="Reshape" op_name="Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.14 = f32[1,8,8,4,32]{4,3,2,1,0} convert(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_3.1), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.16 = f32[] convert(f32[] %Mean_2.15), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,32]{4,3,2,1,0} %Mean_2.14, f32[] %Mean_2.16), dimensions={1,2,4}, to_apply=%Mean_2-reduction.3, metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.20 = s32[] multiply(s32[] %Mean_2.18, s32[] %Mean_2.19), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.21 = s32[] constant(32), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.22 = s32[] multiply(s32[] %Mean_2.20, s32[] %Mean_2.21), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.23 = f32[] convert(s32[] %Mean_2.22), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.24 = f32[1,4]{1,0} broadcast(f32[] %Mean_2.23), dimensions={}, metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean_2.17, f32[1,4]{1,0} %Mean_2.24), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean_2.25), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean_2.26), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_2.27), metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub_3.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.5 = f32[1,8,8,4,32]{4,3,2,1,0} subtract(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_3.1, f32[1,8,8,4,32]{4,3,2,1,0} %sub_3.4), metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_2.27), metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub_2.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.5 = f32[1,8,8,4,32]{4,3,2,1,0} subtract(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_3.1, f32[1,8,8,4,32]{4,3,2,1,0} %sub_2.4), metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Square_1.1 = f32[1,8,8,4,32]{4,3,2,1,0} multiply(f32[1,8,8,4,32]{4,3,2,1,0} %sub_2.5, f32[1,8,8,4,32]{4,3,2,1,0} %sub_2.5), metadata={op_type="Square" op_name="Square_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.14 = f32[1,8,8,4,32]{4,3,2,1,0} convert(f32[1,8,8,4,32]{4,3,2,1,0} %Square_1.1), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.16 = f32[] convert(f32[] %Mean_3.15), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,32]{4,3,2,1,0} %Mean_3.14, f32[] %Mean_3.16), dimensions={1,2,4}, to_apply=%Mean_3-reduction.4, metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.20 = s32[] multiply(s32[] %Mean_3.18, s32[] %Mean_3.19), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.21 = s32[] constant(32), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.22 = s32[] multiply(s32[] %Mean_3.20, s32[] %Mean_3.21), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.23 = f32[] convert(s32[] %Mean_3.22), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.24 = f32[1,4]{1,0} broadcast(f32[] %Mean_3.23), dimensions={}, metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean_3.17, f32[1,4]{1,0} %Mean_3.24), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean_3.25), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean_3.26), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_3.3 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="add_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_3.4 = f32[1,1,1,4,1]{4,3,2,1,0} broadcast(f32[] %add_3.3), dimensions={}, metadata={op_type="AddV2" op_name="add_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_3.5 = f32[1,1,1,4,1]{4,3,2,1,0} add(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_3.27, f32[1,1,1,4,1]{4,3,2,1,0} %add_3.4), metadata={op_type="AddV2" op_name="add_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt_1.1 = f32[1,1,1,4,1]{4,3,2,1,0} rsqrt(f32[1,1,1,4,1]{4,3,2,1,0} %add_3.5), metadata={op_type="Rsqrt" op_name="Rsqrt_1"}
  %mul_4.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Rsqrt_1.1), metadata={op_type="Mul" op_name="mul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_4.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %mul_4.3), dimensions={0,3}, metadata={op_type="Mul" op_name="mul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_4.5 = f32[1,8,8,4,32]{4,3,2,1,0} multiply(f32[1,8,8,4,32]{4,3,2,1,0} %sub_3.5, f32[1,8,8,4,32]{4,3,2,1,0} %mul_4.4), metadata={op_type="Mul" op_name="mul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_4.1 = f32[1,8,8,128]{3,2,1,0} reshape(f32[1,8,8,4,32]{4,3,2,1,0} %mul_4.5), metadata={op_type="Reshape" op_name="Reshape_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg8.1 = f32[128]{0} parameter(8), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.30 = f32[128]{0} reshape(f32[128]{0} %arg8.1)
  %mul_5.2 = f32[1,8,8,128]{3,2,1,0} broadcast(f32[128]{0} %reshape.30), dimensions={3}, metadata={op_type="Mul" op_name="mul_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_5.3 = f32[1,8,8,128]{3,2,1,0} multiply(f32[1,8,8,128]{3,2,1,0} %Reshape_4.1, f32[1,8,8,128]{3,2,1,0} %mul_5.2), metadata={op_type="Mul" op_name="mul_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg9.1 = f32[128]{0} parameter(9), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.31 = f32[128]{0} reshape(f32[128]{0} %arg9.1)
  %add_4.2 = f32[1,8,8,128]{3,2,1,0} broadcast(f32[128]{0} %reshape.31), dimensions={3}, metadata={op_type="AddV2" op_name="add_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_4.3 = f32[1,8,8,128]{3,2,1,0} add(f32[1,8,8,128]{3,2,1,0} %mul_5.3, f32[1,8,8,128]{3,2,1,0} %add_4.2), metadata={op_type="AddV2" op_name="add_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Sigmoid_2.1 = f32[1,8,8,128]{3,2,1,0} logistic(f32[1,8,8,128]{3,2,1,0} %add_4.3), metadata={op_type="Sigmoid" op_name="Sigmoid_2"}
  %mul_6.1 = f32[1,8,8,128]{3,2,1,0} multiply(f32[1,8,8,128]{3,2,1,0} %add_4.3, f32[1,8,8,128]{3,2,1,0} %Sigmoid_2.1), metadata={op_type="Mul" op_name="mul_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg10.1 = f32[128,128]{1,0} parameter(10), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.32 = f32[128,128]{1,0} reshape(f32[128,128]{1,0} %arg10.1)
  %MatMul_1.2 = f32[1,128]{1,0} dot(f32[1,128]{1,0} %mul.1, f32[128,128]{1,0} %reshape.32), lhs_contracting_dims={1}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="MatMul" op_name="MatMul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_1.3 = f32[1,128]{1,0} transpose(f32[1,128]{1,0} %MatMul_1.2), dimensions={0,1}, metadata={op_type="MatMul" op_name="MatMul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_5.1 = f32[1,1,1,128]{3,2,1,0} reshape(f32[1,128]{1,0} %MatMul_1.3), metadata={op_type="Reshape" op_name="Reshape_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_5.3 = f32[1,128]{1,0} reshape(f32[1,1,1,128]{3,2,1,0} %Reshape_5.1), metadata={op_type="AddV2" op_name="add_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_5.4 = f32[1,8,8,128]{3,2,1,0} broadcast(f32[1,128]{1,0} %add_5.3), dimensions={0,3}, metadata={op_type="AddV2" op_name="add_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_5.5 = f32[1,8,8,128]{3,2,1,0} add(f32[1,8,8,128]{3,2,1,0} %mul_6.1, f32[1,8,8,128]{3,2,1,0} %add_5.4), metadata={op_type="AddV2" op_name="add_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_6.1 = f32[1,8,8,4,32]{4,3,2,1,0} reshape(f32[1,8,8,128]{3,2,1,0} %add_5.5), metadata={op_type="Reshape" op_name="Reshape_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.14 = f32[1,8,8,4,32]{4,3,2,1,0} convert(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_6.1), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.16 = f32[] convert(f32[] %Mean_4.15), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,32]{4,3,2,1,0} %Mean_4.14, f32[] %Mean_4.16), dimensions={1,2,4}, to_apply=%Mean_4-reduction.5, metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.20 = s32[] multiply(s32[] %Mean_4.18, s32[] %Mean_4.19), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.21 = s32[] constant(32), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.22 = s32[] multiply(s32[] %Mean_4.20, s32[] %Mean_4.21), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.23 = f32[] convert(s32[] %Mean_4.22), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.24 = f32[1,4]{1,0} broadcast(f32[] %Mean_4.23), dimensions={}, metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean_4.17, f32[1,4]{1,0} %Mean_4.24), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean_4.25), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_4.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean_4.26), metadata={op_type="Mean" op_name="Mean_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_5.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_4.27), metadata={op_type="Sub" op_name="sub_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_5.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub_5.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_5.5 = f32[1,8,8,4,32]{4,3,2,1,0} subtract(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_6.1, f32[1,8,8,4,32]{4,3,2,1,0} %sub_5.4), metadata={op_type="Sub" op_name="sub_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_4.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_4.27), metadata={op_type="Sub" op_name="sub_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_4.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %sub_4.3), dimensions={0,3}, metadata={op_type="Sub" op_name="sub_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_4.5 = f32[1,8,8,4,32]{4,3,2,1,0} subtract(f32[1,8,8,4,32]{4,3,2,1,0} %Reshape_6.1, f32[1,8,8,4,32]{4,3,2,1,0} %sub_4.4), metadata={op_type="Sub" op_name="sub_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Square_2.1 = f32[1,8,8,4,32]{4,3,2,1,0} multiply(f32[1,8,8,4,32]{4,3,2,1,0} %sub_4.5, f32[1,8,8,4,32]{4,3,2,1,0} %sub_4.5), metadata={op_type="Square" op_name="Square_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.14 = f32[1,8,8,4,32]{4,3,2,1,0} convert(f32[1,8,8,4,32]{4,3,2,1,0} %Square_2.1), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.15 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.16 = f32[] convert(f32[] %Mean_5.15), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.17 = f32[1,4]{1,0} reduce(f32[1,8,8,4,32]{4,3,2,1,0} %Mean_5.14, f32[] %Mean_5.16), dimensions={1,2,4}, to_apply=%Mean_5-reduction.6, metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.18 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.19 = s32[] constant(8), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.20 = s32[] multiply(s32[] %Mean_5.18, s32[] %Mean_5.19), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.21 = s32[] constant(32), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.22 = s32[] multiply(s32[] %Mean_5.20, s32[] %Mean_5.21), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.23 = f32[] convert(s32[] %Mean_5.22), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.24 = f32[1,4]{1,0} broadcast(f32[] %Mean_5.23), dimensions={}, metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.25 = f32[1,4]{1,0} divide(f32[1,4]{1,0} %Mean_5.17, f32[1,4]{1,0} %Mean_5.24), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.26 = f32[1,4]{1,0} convert(f32[1,4]{1,0} %Mean_5.25), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_5.27 = f32[1,1,1,4,1]{4,3,2,1,0} reshape(f32[1,4]{1,0} %Mean_5.26), metadata={op_type="Mean" op_name="Mean_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_6.3 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_6.4 = f32[1,1,1,4,1]{4,3,2,1,0} broadcast(f32[] %add_6.3), dimensions={}, metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_6.5 = f32[1,1,1,4,1]{4,3,2,1,0} add(f32[1,1,1,4,1]{4,3,2,1,0} %Mean_5.27, f32[1,1,1,4,1]{4,3,2,1,0} %add_6.4), metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt_2.1 = f32[1,1,1,4,1]{4,3,2,1,0} rsqrt(f32[1,1,1,4,1]{4,3,2,1,0} %add_6.5), metadata={op_type="Rsqrt" op_name="Rsqrt_2"}
  %mul_7.3 = f32[1,4]{1,0} reshape(f32[1,1,1,4,1]{4,3,2,1,0} %Rsqrt_2.1), metadata={op_type="Mul" op_name="mul_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_7.4 = f32[1,8,8,4,32]{4,3,2,1,0} broadcast(f32[1,4]{1,0} %mul_7.3), dimensions={0,3}, metadata={op_type="Mul" op_name="mul_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_7.5 = f32[1,8,8,4,32]{4,3,2,1,0} multiply(f32[1,8,8,4,32]{4,3,2,1,0} %sub_5.5, f32[1,8,8,4,32]{4,3,2,1,0} %mul_7.4), metadata={op_type="Mul" op_name="mul_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_7.1 = f32[1,8,8,128]{3,2,1,0} reshape(f32[1,8,8,4,32]{4,3,2,1,0} %mul_7.5), metadata={op_type="Reshape" op_name="Reshape_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg16.1 = f32[128]{0} parameter(16), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.38 = f32[128]{0} reshape(f32[128]{0} %arg16.1)
  %mul_8.2 = f32[1,8,8,128]{3,2,1,0} broadcast(f32[128]{0} %reshape.38), dimensions={3}, metadata={op_type="Mul" op_name="mul_8" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_8.3 = f32[1,8,8,128]{3,2,1,0} multiply(f32[1,8,8,128]{3,2,1,0} %Reshape_7.1, f32[1,8,8,128]{3,2,1,0} %mul_8.2), metadata={op_type="Mul" op_name="mul_8" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg17.1 = f32[128]{0} parameter(17), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.39 = f32[128]{0} reshape(f32[128]{0} %arg17.1)
  %add_7.2 = f32[1,8,8,128]{3,2,1,0} broadcast(f32[128]{0} %reshape.39), dimensions={3}, metadata={op_type="AddV2" op_name="add_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_7.3 = f32[1,8,8,128]{3,2,1,0} add(f32[1,8,8,128]{3,2,1,0} %mul_8.3, f32[1,8,8,128]{3,2,1,0} %add_7.2), metadata={op_type="AddV2" op_name="add_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_8.1 = f32[1,64,128]{2,1,0} reshape(f32[1,8,8,128]{3,2,1,0} %add_7.3), metadata={op_type="Reshape" op_name="Reshape_8" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
