HloModule a_inference_whisper_decoder_609__.43, entry_computation_layout={(f32[1,1500,384]{2,1,0}, f32[1,64,384]{2,1,0}, f32[1,64,384]{2,1,0}, f32[1,1,64,64]{3,2,1,0}, f32[384]{0}, /*index=5*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=10*/f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384]{0}, /*index=15*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=20*/f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384]{0}, /*index=25*/f32[384]{0}, f32[384,1536]{1,0}, f32[1536]{0}, f32[1536,384]{1,0}, f32[384]{0}, /*index=30*/f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, /*index=35*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=40*/f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, /*index=45*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=50*/f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[1536]{0}, f32[1536,384]{1,0}, /*index=55*/f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=60*/f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, /*index=65*/f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=70*/f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, /*index=75*/f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[1536]{0}, /*index=80*/f32[1536,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, /*index=85*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=90*/f32[384,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,384]{1,0}, /*index=95*/f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, f32[384,384]{1,0}, f32[384]{0}, /*index=100*/f32[384,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, /*index=105*/f32[1536]{0}, f32[1536,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384]{0}, /*index=110*/f32[384,51865]{1,0})->f32[1,64,51865]{2,1,0}}

%Mean-reduction.1 (x.1: f32[], y.1: f32[]) -> f32[] {
  %x.1 = f32[] parameter(0)
  %y.1 = f32[] parameter(1)
  ROOT %add.1 = f32[] add(f32[] %x.1, f32[] %y.1)
}

%Mean_1-reduction.2 (x.0: f32[], y.0: f32[]) -> f32[] {
  %x.0 = f32[] parameter(0)
  %y.0 = f32[] parameter(1)
  ROOT %add.2 = f32[] add(f32[] %x.0, f32[] %y.0)
}

%region_0.3 (Softmax.5: f32[], Softmax.6: f32[]) -> f32[] {
  %Softmax.5 = f32[] parameter(0), metadata={op_name="Softmax"}
  %Softmax.6 = f32[] parameter(1), metadata={op_name="Softmax"}
  ROOT %Softmax.7 = f32[] maximum(f32[] %Softmax.5, f32[] %Softmax.6), metadata={op_type="Softmax" op_name="Softmax"}
}

%region_1.4 (Softmax.18: f32[], Softmax.19: f32[]) -> f32[] {
  %Softmax.18 = f32[] parameter(0), metadata={op_name="Softmax"}
  %Softmax.19 = f32[] parameter(1), metadata={op_name="Softmax"}
  ROOT %Softmax.20 = f32[] add(f32[] %Softmax.18, f32[] %Softmax.19), metadata={op_type="Softmax" op_name="Softmax"}
}

%Mean_2-reduction.5 (x.2: f32[], y.2: f32[]) -> f32[] {
  %x.2 = f32[] parameter(0)
  %y.2 = f32[] parameter(1)
  ROOT %add.3 = f32[] add(f32[] %x.2, f32[] %y.2)
}

%Mean_3-reduction.6 (x.3: f32[], y.3: f32[]) -> f32[] {
  %x.3 = f32[] parameter(0)
  %y.3 = f32[] parameter(1)
  ROOT %add.4 = f32[] add(f32[] %x.3, f32[] %y.3)
}

%region_0.7 (Softmax_1.5: f32[], Softmax_1.6: f32[]) -> f32[] {
  %Softmax_1.5 = f32[] parameter(0), metadata={op_name="Softmax_1"}
  %Softmax_1.6 = f32[] parameter(1), metadata={op_name="Softmax_1"}
  ROOT %Softmax_1.7 = f32[] maximum(f32[] %Softmax_1.5, f32[] %Softmax_1.6), metadata={op_type="Softmax" op_name="Softmax_1"}
}

%region_1.8 (Softmax_1.18: f32[], Softmax_1.19: f32[]) -> f32[] {
  %Softmax_1.18 = f32[] parameter(0), metadata={op_name="Softmax_1"}
  %Softmax_1.19 = f32[] parameter(1), metadata={op_name="Softmax_1"}
  ROOT %Softmax_1.20 = f32[] add(f32[] %Softmax_1.18, f32[] %Softmax_1.19), metadata={op_type="Softmax" op_name="Softmax_1"}
}

%Mean_4-reduction.9 (x.4: f32[], y.4: f32[]) -> f32[] {
  %x.4 = f32[] parameter(0)
  %y.4 = f32[] parameter(1)
  ROOT %add.5 = f32[] add(f32[] %x.4, f32[] %y.4)
}

%Mean_5-reduction.10 (x.5: f32[], y.5: f32[]) -> f32[] {
  %x.5 = f32[] parameter(0)
  %y.5 = f32[] parameter(1)
  ROOT %add.6 = f32[] add(f32[] %x.5, f32[] %y.5)
}

%Mean_6-reduction.11 (x.6: f32[], y.6: f32[]) -> f32[] {
  %x.6 = f32[] parameter(0)
  %y.6 = f32[] parameter(1)
  ROOT %add.7 = f32[] add(f32[] %x.6, f32[] %y.6)
}

%Mean_7-reduction.12 (x.7: f32[], y.7: f32[]) -> f32[] {
  %x.7 = f32[] parameter(0)
  %y.7 = f32[] parameter(1)
  ROOT %add.8 = f32[] add(f32[] %x.7, f32[] %y.7)
}

%region_0.13 (Softmax_2.5: f32[], Softmax_2.6: f32[]) -> f32[] {
  %Softmax_2.5 = f32[] parameter(0), metadata={op_name="Softmax_2"}
  %Softmax_2.6 = f32[] parameter(1), metadata={op_name="Softmax_2"}
  ROOT %Softmax_2.7 = f32[] maximum(f32[] %Softmax_2.5, f32[] %Softmax_2.6), metadata={op_type="Softmax" op_name="Softmax_2"}
}

%region_1.14 (Softmax_2.18: f32[], Softmax_2.19: f32[]) -> f32[] {
  %Softmax_2.18 = f32[] parameter(0), metadata={op_name="Softmax_2"}
  %Softmax_2.19 = f32[] parameter(1), metadata={op_name="Softmax_2"}
  ROOT %Softmax_2.20 = f32[] add(f32[] %Softmax_2.18, f32[] %Softmax_2.19), metadata={op_type="Softmax" op_name="Softmax_2"}
}

%Mean_8-reduction.15 (x.8: f32[], y.8: f32[]) -> f32[] {
  %x.8 = f32[] parameter(0)
  %y.8 = f32[] parameter(1)
  ROOT %add.9 = f32[] add(f32[] %x.8, f32[] %y.8)
}

%Mean_9-reduction.16 (x.9: f32[], y.9: f32[]) -> f32[] {
  %x.9 = f32[] parameter(0)
  %y.9 = f32[] parameter(1)
  ROOT %add.10 = f32[] add(f32[] %x.9, f32[] %y.9)
}

%region_0.17 (Softmax_3.5: f32[], Softmax_3.6: f32[]) -> f32[] {
  %Softmax_3.5 = f32[] parameter(0), metadata={op_name="Softmax_3"}
  %Softmax_3.6 = f32[] parameter(1), metadata={op_name="Softmax_3"}
  ROOT %Softmax_3.7 = f32[] maximum(f32[] %Softmax_3.5, f32[] %Softmax_3.6), metadata={op_type="Softmax" op_name="Softmax_3"}
}

%region_1.18 (Softmax_3.18: f32[], Softmax_3.19: f32[]) -> f32[] {
  %Softmax_3.18 = f32[] parameter(0), metadata={op_name="Softmax_3"}
  %Softmax_3.19 = f32[] parameter(1), metadata={op_name="Softmax_3"}
  ROOT %Softmax_3.20 = f32[] add(f32[] %Softmax_3.18, f32[] %Softmax_3.19), metadata={op_type="Softmax" op_name="Softmax_3"}
}

%Mean_10-reduction.19 (x.10: f32[], y.10: f32[]) -> f32[] {
  %x.10 = f32[] parameter(0)
  %y.10 = f32[] parameter(1)
  ROOT %add.11 = f32[] add(f32[] %x.10, f32[] %y.10)
}

%Mean_11-reduction.20 (x.11: f32[], y.11: f32[]) -> f32[] {
  %x.11 = f32[] parameter(0)
  %y.11 = f32[] parameter(1)
  ROOT %add.12 = f32[] add(f32[] %x.11, f32[] %y.11)
}

%Mean_12-reduction.21 (x.12: f32[], y.12: f32[]) -> f32[] {
  %x.12 = f32[] parameter(0)
  %y.12 = f32[] parameter(1)
  ROOT %add.13 = f32[] add(f32[] %x.12, f32[] %y.12)
}

%Mean_13-reduction.22 (x.13: f32[], y.13: f32[]) -> f32[] {
  %x.13 = f32[] parameter(0)
  %y.13 = f32[] parameter(1)
  ROOT %add.14 = f32[] add(f32[] %x.13, f32[] %y.13)
}

%region_0.23 (Softmax_4.5: f32[], Softmax_4.6: f32[]) -> f32[] {
  %Softmax_4.5 = f32[] parameter(0), metadata={op_name="Softmax_4"}
  %Softmax_4.6 = f32[] parameter(1), metadata={op_name="Softmax_4"}
  ROOT %Softmax_4.7 = f32[] maximum(f32[] %Softmax_4.5, f32[] %Softmax_4.6), metadata={op_type="Softmax" op_name="Softmax_4"}
}

%region_1.24 (Softmax_4.18: f32[], Softmax_4.19: f32[]) -> f32[] {
  %Softmax_4.18 = f32[] parameter(0), metadata={op_name="Softmax_4"}
  %Softmax_4.19 = f32[] parameter(1), metadata={op_name="Softmax_4"}
  ROOT %Softmax_4.20 = f32[] add(f32[] %Softmax_4.18, f32[] %Softmax_4.19), metadata={op_type="Softmax" op_name="Softmax_4"}
}

%Mean_14-reduction.25 (x.14: f32[], y.14: f32[]) -> f32[] {
  %x.14 = f32[] parameter(0)
  %y.14 = f32[] parameter(1)
  ROOT %add.15 = f32[] add(f32[] %x.14, f32[] %y.14)
}

%Mean_15-reduction.26 (x.15: f32[], y.15: f32[]) -> f32[] {
  %x.15 = f32[] parameter(0)
  %y.15 = f32[] parameter(1)
  ROOT %add.16 = f32[] add(f32[] %x.15, f32[] %y.15)
}

%region_0.27 (Softmax_5.5: f32[], Softmax_5.6: f32[]) -> f32[] {
  %Softmax_5.5 = f32[] parameter(0), metadata={op_name="Softmax_5"}
  %Softmax_5.6 = f32[] parameter(1), metadata={op_name="Softmax_5"}
  ROOT %Softmax_5.7 = f32[] maximum(f32[] %Softmax_5.5, f32[] %Softmax_5.6), metadata={op_type="Softmax" op_name="Softmax_5"}
}

%region_1.28 (Softmax_5.18: f32[], Softmax_5.19: f32[]) -> f32[] {
  %Softmax_5.18 = f32[] parameter(0), metadata={op_name="Softmax_5"}
  %Softmax_5.19 = f32[] parameter(1), metadata={op_name="Softmax_5"}
  ROOT %Softmax_5.20 = f32[] add(f32[] %Softmax_5.18, f32[] %Softmax_5.19), metadata={op_type="Softmax" op_name="Softmax_5"}
}

%Mean_16-reduction.29 (x.16: f32[], y.16: f32[]) -> f32[] {
  %x.16 = f32[] parameter(0)
  %y.16 = f32[] parameter(1)
  ROOT %add.17 = f32[] add(f32[] %x.16, f32[] %y.16)
}

%Mean_17-reduction.30 (x.17: f32[], y.17: f32[]) -> f32[] {
  %x.17 = f32[] parameter(0)
  %y.17 = f32[] parameter(1)
  ROOT %add.18 = f32[] add(f32[] %x.17, f32[] %y.17)
}

%Mean_18-reduction.31 (x.18: f32[], y.18: f32[]) -> f32[] {
  %x.18 = f32[] parameter(0)
  %y.18 = f32[] parameter(1)
  ROOT %add.19 = f32[] add(f32[] %x.18, f32[] %y.18)
}

%Mean_19-reduction.32 (x.19: f32[], y.19: f32[]) -> f32[] {
  %x.19 = f32[] parameter(0)
  %y.19 = f32[] parameter(1)
  ROOT %add.20 = f32[] add(f32[] %x.19, f32[] %y.19)
}

%region_0.33 (Softmax_6.5: f32[], Softmax_6.6: f32[]) -> f32[] {
  %Softmax_6.5 = f32[] parameter(0), metadata={op_name="Softmax_6"}
  %Softmax_6.6 = f32[] parameter(1), metadata={op_name="Softmax_6"}
  ROOT %Softmax_6.7 = f32[] maximum(f32[] %Softmax_6.5, f32[] %Softmax_6.6), metadata={op_type="Softmax" op_name="Softmax_6"}
}

%region_1.34 (Softmax_6.18: f32[], Softmax_6.19: f32[]) -> f32[] {
  %Softmax_6.18 = f32[] parameter(0), metadata={op_name="Softmax_6"}
  %Softmax_6.19 = f32[] parameter(1), metadata={op_name="Softmax_6"}
  ROOT %Softmax_6.20 = f32[] add(f32[] %Softmax_6.18, f32[] %Softmax_6.19), metadata={op_type="Softmax" op_name="Softmax_6"}
}

%Mean_20-reduction.35 (x.20: f32[], y.20: f32[]) -> f32[] {
  %x.20 = f32[] parameter(0)
  %y.20 = f32[] parameter(1)
  ROOT %add.21 = f32[] add(f32[] %x.20, f32[] %y.20)
}

%Mean_21-reduction.36 (x.21: f32[], y.21: f32[]) -> f32[] {
  %x.21 = f32[] parameter(0)
  %y.21 = f32[] parameter(1)
  ROOT %add.22 = f32[] add(f32[] %x.21, f32[] %y.21)
}

%region_0.37 (Softmax_7.5: f32[], Softmax_7.6: f32[]) -> f32[] {
  %Softmax_7.5 = f32[] parameter(0), metadata={op_name="Softmax_7"}
  %Softmax_7.6 = f32[] parameter(1), metadata={op_name="Softmax_7"}
  ROOT %Softmax_7.7 = f32[] maximum(f32[] %Softmax_7.5, f32[] %Softmax_7.6), metadata={op_type="Softmax" op_name="Softmax_7"}
}

%region_1.38 (Softmax_7.18: f32[], Softmax_7.19: f32[]) -> f32[] {
  %Softmax_7.18 = f32[] parameter(0), metadata={op_name="Softmax_7"}
  %Softmax_7.19 = f32[] parameter(1), metadata={op_name="Softmax_7"}
  ROOT %Softmax_7.20 = f32[] add(f32[] %Softmax_7.18, f32[] %Softmax_7.19), metadata={op_type="Softmax" op_name="Softmax_7"}
}

%Mean_22-reduction.39 (x.22: f32[], y.22: f32[]) -> f32[] {
  %x.22 = f32[] parameter(0)
  %y.22 = f32[] parameter(1)
  ROOT %add.23 = f32[] add(f32[] %x.22, f32[] %y.22)
}

%Mean_23-reduction.40 (x.23: f32[], y.23: f32[]) -> f32[] {
  %x.23 = f32[] parameter(0)
  %y.23 = f32[] parameter(1)
  ROOT %add.24 = f32[] add(f32[] %x.23, f32[] %y.23)
}

%Mean_24-reduction.41 (x.24: f32[], y.24: f32[]) -> f32[] {
  %x.24 = f32[] parameter(0)
  %y.24 = f32[] parameter(1)
  ROOT %add.25 = f32[] add(f32[] %x.24, f32[] %y.24)
}

%Mean_25-reduction.42 (x.25: f32[], y.25: f32[]) -> f32[] {
  %x.25 = f32[] parameter(0)
  %y.25 = f32[] parameter(1)
  ROOT %add.26 = f32[] add(f32[] %x.25, f32[] %y.25)
}

ENTRY %a_inference_whisper_decoder_609__.43 (arg0.1: f32[1,1500,384], arg1.1: f32[1,64,384], arg2.1: f32[1,64,384], arg3.1: f32[1,1,64,64], arg4.1: f32[384], arg5.1: f32[384], arg6.1: f32[384,384], arg7.1: f32[384], arg8.1: f32[384,384], arg9.1: f32[384], arg10.1: f32[384,384], arg11.1: f32[384], arg12.1: f32[384,384], arg13.1: f32[384], arg14.1: f32[384], arg15.1: f32[384], arg16.1: f32[384,384], arg17.1: f32[384], arg18.1: f32[384,384], arg19.1: f32[384], arg20.1: f32[384,384], arg21.1: f32[384], arg22.1: f32[384,384], arg23.1: f32[384], arg24.1: f32[384], arg25.1: f32[384], arg26.1: f32[384,1536], arg27.1: f32[1536], arg28.1: f32[1536,384], arg29.1: f32[384], arg30.1: f32[384], arg31.1: f32[384], arg32.1: f32[384,384], arg33.1: f32[384], arg34.1: f32[384,384], arg35.1: f32[384], arg36.1: f32[384,384], arg37.1: f32[384], arg38.1: f32[384,384], arg39.1: f32[384], arg40.1: f32[384], arg41.1: f32[384], arg42.1: f32[384,384], arg43.1: f32[384], arg44.1: f32[384,384], arg45.1: f32[384], arg46.1: f32[384,384], arg47.1: f32[384], arg48.1: f32[384,384], arg49.1: f32[384], arg50.1: f32[384], arg51.1: f32[384], arg52.1: f32[384,1536], arg53.1: f32[1536], arg54.1: f32[1536,384], arg55.1: f32[384], arg56.1: f32[384], arg57.1: f32[384], arg58.1: f32[384,384], arg59.1: f32[384], arg60.1: f32[384,384], arg61.1: f32[384], arg62.1: f32[384,384], arg63.1: f32[384], arg64.1: f32[384,384], arg65.1: f32[384], arg66.1: f32[384], arg67.1: f32[384], arg68.1: f32[384,384], arg69.1: f32[384], arg70.1: f32[384,384], arg71.1: f32[384], arg72.1: f32[384,384], arg73.1: f32[384], arg74.1: f32[384,384], arg75.1: f32[384], arg76.1: f32[384], arg77.1: f32[384], arg78.1: f32[384,1536], arg79.1: f32[1536], arg80.1: f32[1536,384], arg81.1: f32[384], arg82.1: f32[384], arg83.1: f32[384], arg84.1: f32[384,384], arg85.1: f32[384], arg86.1: f32[384,384], arg87.1: f32[384], arg88.1: f32[384,384], arg89.1: f32[384], arg90.1: f32[384,384], arg91.1: f32[384], arg92.1: f32[384], arg93.1: f32[384], arg94.1: f32[384,384], arg95.1: f32[384], arg96.1: f32[384,384], arg97.1: f32[384], arg98.1: f32[384,384], arg99.1: f32[384], arg100.1: f32[384,384], arg101.1: f32[384], arg102.1: f32[384], arg103.1: f32[384], arg104.1: f32[384,1536], arg105.1: f32[1536], arg106.1: f32[1536,384], arg107.1: f32[384], arg108.1: f32[384], arg109.1: f32[384], arg110.1: f32[384,51865]) -> f32[1,64,51865] {
  %arg1.1 = f32[1,64,384]{2,1,0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.112 = f32[1,64,384]{2,1,0} reshape(f32[1,64,384]{2,1,0} %arg1.1)
  %arg2.1 = f32[1,64,384]{2,1,0} parameter(2), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.113 = f32[1,64,384]{2,1,0} reshape(f32[1,64,384]{2,1,0} %arg2.1)
  %add.27 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %reshape.112, f32[1,64,384]{2,1,0} %reshape.113), metadata={op_type="AddV2" op_name="add" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.10 = f32[1,64,384]{2,1,0} convert(f32[1,64,384]{2,1,0} %add.27), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.11 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.12 = f32[] convert(f32[] %Mean.11), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.13 = f32[1,64]{1,0} reduce(f32[1,64,384]{2,1,0} %Mean.10, f32[] %Mean.12), dimensions={2}, to_apply=%Mean-reduction.1, metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.14 = s32[] constant(384), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.15 = f32[] convert(s32[] %Mean.14), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.16 = f32[1,64]{1,0} broadcast(f32[] %Mean.15), dimensions={}, metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.17 = f32[1,64]{1,0} divide(f32[1,64]{1,0} %Mean.13, f32[1,64]{1,0} %Mean.16), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.18 = f32[1,64]{1,0} convert(f32[1,64]{1,0} %Mean.17), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean.19 = f32[1,64,1]{2,1,0} reshape(f32[1,64]{1,0} %Mean.18), metadata={op_type="Mean" op_name="Mean" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Mean.19), metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %sub_1.3), dimensions={0,1}, metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_1.5 = f32[1,64,384]{2,1,0} subtract(f32[1,64,384]{2,1,0} %add.27, f32[1,64,384]{2,1,0} %sub_1.4), metadata={op_type="Sub" op_name="sub_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Mean.19), metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %sub.3), dimensions={0,1}, metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub.5 = f32[1,64,384]{2,1,0} subtract(f32[1,64,384]{2,1,0} %add.27, f32[1,64,384]{2,1,0} %sub.4), metadata={op_type="Sub" op_name="sub" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Square.1 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %sub.5, f32[1,64,384]{2,1,0} %sub.5), metadata={op_type="Square" op_name="Square" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.10 = f32[1,64,384]{2,1,0} convert(f32[1,64,384]{2,1,0} %Square.1), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.11 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.12 = f32[] convert(f32[] %Mean_1.11), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.13 = f32[1,64]{1,0} reduce(f32[1,64,384]{2,1,0} %Mean_1.10, f32[] %Mean_1.12), dimensions={2}, to_apply=%Mean_1-reduction.2, metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.14 = s32[] constant(384), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.15 = f32[] convert(s32[] %Mean_1.14), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.16 = f32[1,64]{1,0} broadcast(f32[] %Mean_1.15), dimensions={}, metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.17 = f32[1,64]{1,0} divide(f32[1,64]{1,0} %Mean_1.13, f32[1,64]{1,0} %Mean_1.16), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.18 = f32[1,64]{1,0} convert(f32[1,64]{1,0} %Mean_1.17), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_1.19 = f32[1,64,1]{2,1,0} reshape(f32[1,64]{1,0} %Mean_1.18), metadata={op_type="Mean" op_name="Mean_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.3 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.4 = f32[1,64,1]{2,1,0} broadcast(f32[] %add_1.3), dimensions={}, metadata={op_type="AddV2" op_name="add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_1.5 = f32[1,64,1]{2,1,0} add(f32[1,64,1]{2,1,0} %Mean_1.19, f32[1,64,1]{2,1,0} %add_1.4), metadata={op_type="AddV2" op_name="add_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt.1 = f32[1,64,1]{2,1,0} rsqrt(f32[1,64,1]{2,1,0} %add_1.5), metadata={op_type="Rsqrt" op_name="Rsqrt"}
  %mul.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Rsqrt.1), metadata={op_type="Mul" op_name="mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %mul.3), dimensions={0,1}, metadata={op_type="Mul" op_name="mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul.5 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %sub_1.5, f32[1,64,384]{2,1,0} %mul.4), metadata={op_type="Mul" op_name="mul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg4.1 = f32[384]{0} parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.115 = f32[384]{0} reshape(f32[384]{0} %arg4.1)
  %mul_1.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.115), dimensions={2}, metadata={op_type="Mul" op_name="mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_1.3 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %mul.5, f32[1,64,384]{2,1,0} %mul_1.2), metadata={op_type="Mul" op_name="mul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg5.1 = f32[384]{0} parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.116 = f32[384]{0} reshape(f32[384]{0} %arg5.1)
  %add_2.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.116), dimensions={2}, metadata={op_type="AddV2" op_name="add_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_2.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %mul_1.3, f32[1,64,384]{2,1,0} %add_2.2), metadata={op_type="AddV2" op_name="add_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg6.1 = f32[384,384]{1,0} parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.117 = f32[384,384]{1,0} reshape(f32[384,384]{1,0} %arg6.1)
  %MatMul.2 = f32[1,64,384]{2,1,0} dot(f32[1,64,384]{2,1,0} %add_2.3, f32[384,384]{1,0} %reshape.117), lhs_contracting_dims={2}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul.3 = f32[1,64,384]{2,1,0} transpose(f32[1,64,384]{2,1,0} %MatMul.2), dimensions={0,1,2}, metadata={op_type="BatchMatMulV2" op_name="MatMul" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg7.1 = f32[384]{0} parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.118 = f32[384]{0} reshape(f32[384]{0} %arg7.1)
  %add_3.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.118), dimensions={2}, metadata={op_type="AddV2" op_name="add_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_3.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %MatMul.3, f32[1,64,384]{2,1,0} %add_3.2), metadata={op_type="AddV2" op_name="add_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape.1 = f32[1,64,6,64]{3,2,1,0} reshape(f32[1,64,384]{2,1,0} %add_3.3), metadata={op_type="Reshape" op_name="Reshape" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %transpose.1 = f32[1,6,64,64]{3,1,2,0} transpose(f32[1,64,6,64]{3,2,1,0} %Reshape.1), dimensions={0,2,1,3}, metadata={op_type="Transpose" op_name="transpose" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg8.1 = f32[384,384]{1,0} parameter(8), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.119 = f32[384,384]{1,0} reshape(f32[384,384]{1,0} %arg8.1)
  %MatMul_1.2 = f32[1,64,384]{2,1,0} dot(f32[1,64,384]{2,1,0} %add_2.3, f32[384,384]{1,0} %reshape.119), lhs_contracting_dims={2}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_1.3 = f32[1,64,384]{2,1,0} transpose(f32[1,64,384]{2,1,0} %MatMul_1.2), dimensions={0,1,2}, metadata={op_type="BatchMatMulV2" op_name="MatMul_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg9.1 = f32[384]{0} parameter(9), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.120 = f32[384]{0} reshape(f32[384]{0} %arg9.1)
  %add_4.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.120), dimensions={2}, metadata={op_type="AddV2" op_name="add_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_4.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %MatMul_1.3, f32[1,64,384]{2,1,0} %add_4.2), metadata={op_type="AddV2" op_name="add_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_1.1 = f32[1,64,6,64]{3,2,1,0} reshape(f32[1,64,384]{2,1,0} %add_4.3), metadata={op_type="Reshape" op_name="Reshape_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %transpose_1.1 = f32[1,6,64,64]{3,1,2,0} transpose(f32[1,64,6,64]{3,2,1,0} %Reshape_1.1), dimensions={0,2,1,3}, metadata={op_type="Transpose" op_name="transpose_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_3.2 = f32[1,6,64,64]{3,2,1,0} dot(f32[1,6,64,64]{3,1,2,0} %transpose.1, f32[1,6,64,64]{3,1,2,0} %transpose_1.1), lhs_batch_dims={0,1}, lhs_contracting_dims={3}, rhs_batch_dims={0,1}, rhs_contracting_dims={3}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_3.3 = f32[1,6,64,64]{3,2,1,0} transpose(f32[1,6,64,64]{3,2,1,0} %MatMul_3.2), dimensions={0,1,2,3}, metadata={op_type="BatchMatMulV2" op_name="MatMul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.3 = f32[] constant(0.125), metadata={op_type="Mul" op_name="mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.4 = f32[1,6,64,64]{3,2,1,0} broadcast(f32[] %mul_2.3), dimensions={}, metadata={op_type="Mul" op_name="mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_2.5 = f32[1,6,64,64]{3,2,1,0} multiply(f32[1,6,64,64]{3,2,1,0} %MatMul_3.3, f32[1,6,64,64]{3,2,1,0} %mul_2.4), metadata={op_type="Mul" op_name="mul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg3.1 = f32[1,1,64,64]{3,2,1,0} parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.114 = f32[1,1,64,64]{3,2,1,0} reshape(f32[1,1,64,64]{3,2,1,0} %arg3.1)
  %add_6.3 = f32[1,64,64]{2,1,0} reshape(f32[1,1,64,64]{3,2,1,0} %reshape.114), metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_6.4 = f32[1,6,64,64]{3,2,1,0} broadcast(f32[1,64,64]{2,1,0} %add_6.3), dimensions={0,2,3}, metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_6.5 = f32[1,6,64,64]{3,2,1,0} add(f32[1,6,64,64]{3,2,1,0} %mul_2.5, f32[1,6,64,64]{3,2,1,0} %add_6.4), metadata={op_type="AddV2" op_name="add_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Softmax.28 = f32[] constant(-inf), metadata={op_type="Softmax" op_name="Softmax" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Softmax.29 = f32[1,6,64]{2,1,0} reduce(f32[1,6,64,64]{3,2,1,0} %add_6.5, f32[] %Softmax.28), dimensions={3}, to_apply=%region_0.3, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.30 = f32[1,6,64,1]{3,2,1,0} reshape(f32[1,6,64]{2,1,0} %Softmax.29), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.31 = f32[1,6,64,1]{3,2,1,0} broadcast(f32[1,6,64,1]{3,2,1,0} %Softmax.30), dimensions={0,1,2,3}, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.32 = f32[1,6,64]{2,1,0} reshape(f32[1,6,64,1]{3,2,1,0} %Softmax.31), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.33 = f32[1,6,64,64]{3,2,1,0} broadcast(f32[1,6,64]{2,1,0} %Softmax.32), dimensions={0,1,2}, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.34 = f32[1,6,64,64]{3,2,1,0} subtract(f32[1,6,64,64]{3,2,1,0} %add_6.5, f32[1,6,64,64]{3,2,1,0} %Softmax.33), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.35 = f32[1,6,64,64]{3,2,1,0} exponential(f32[1,6,64,64]{3,2,1,0} %Softmax.34), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.27 = f32[] constant(-0), metadata={op_type="Softmax" op_name="Softmax" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Softmax.36 = f32[1,6,64]{2,1,0} reduce(f32[1,6,64,64]{3,2,1,0} %Softmax.35, f32[] %Softmax.27), dimensions={3}, to_apply=%region_1.4, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.37 = f32[1,6,64,1]{3,2,1,0} reshape(f32[1,6,64]{2,1,0} %Softmax.36), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.38 = f32[1,6,64,1]{3,2,1,0} broadcast(f32[1,6,64,1]{3,2,1,0} %Softmax.37), dimensions={0,1,2,3}, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.39 = f32[1,6,64]{2,1,0} reshape(f32[1,6,64,1]{3,2,1,0} %Softmax.38), metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.40 = f32[1,6,64,64]{3,2,1,0} broadcast(f32[1,6,64]{2,1,0} %Softmax.39), dimensions={0,1,2}, metadata={op_type="Softmax" op_name="Softmax"}
  %Softmax.41 = f32[1,6,64,64]{3,2,1,0} divide(f32[1,6,64,64]{3,2,1,0} %Softmax.35, f32[1,6,64,64]{3,2,1,0} %Softmax.40), metadata={op_type="Softmax" op_name="Softmax"}
  %arg10.1 = f32[384,384]{1,0} parameter(10), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.121 = f32[384,384]{1,0} reshape(f32[384,384]{1,0} %arg10.1)
  %MatMul_2.2 = f32[1,64,384]{2,1,0} dot(f32[1,64,384]{2,1,0} %add_2.3, f32[384,384]{1,0} %reshape.121), lhs_contracting_dims={2}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_2.3 = f32[1,64,384]{2,1,0} transpose(f32[1,64,384]{2,1,0} %MatMul_2.2), dimensions={0,1,2}, metadata={op_type="BatchMatMulV2" op_name="MatMul_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg11.1 = f32[384]{0} parameter(11), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.122 = f32[384]{0} reshape(f32[384]{0} %arg11.1)
  %add_5.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.122), dimensions={2}, metadata={op_type="AddV2" op_name="add_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_5.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %MatMul_2.3, f32[1,64,384]{2,1,0} %add_5.2), metadata={op_type="AddV2" op_name="add_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_2.1 = f32[1,64,6,64]{3,2,1,0} reshape(f32[1,64,384]{2,1,0} %add_5.3), metadata={op_type="Reshape" op_name="Reshape_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %transpose_2.1 = f32[1,6,64,64]{3,1,2,0} transpose(f32[1,64,6,64]{3,2,1,0} %Reshape_2.1), dimensions={0,2,1,3}, metadata={op_type="Transpose" op_name="transpose_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_4.2 = f32[1,6,64,64]{3,2,1,0} dot(f32[1,6,64,64]{3,2,1,0} %Softmax.41, f32[1,6,64,64]{3,1,2,0} %transpose_2.1), lhs_batch_dims={0,1}, lhs_contracting_dims={3}, rhs_batch_dims={0,1}, rhs_contracting_dims={2}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_4.3 = f32[1,6,64,64]{3,2,1,0} transpose(f32[1,6,64,64]{3,2,1,0} %MatMul_4.2), dimensions={0,1,2,3}, metadata={op_type="BatchMatMulV2" op_name="MatMul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %transpose_3.1 = f32[1,64,6,64]{3,1,2,0} transpose(f32[1,6,64,64]{3,2,1,0} %MatMul_4.3), dimensions={0,2,1,3}, metadata={op_type="Transpose" op_name="transpose_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Reshape_3.1 = f32[1,64,384]{2,1,0} reshape(f32[1,64,6,64]{3,1,2,0} %transpose_3.1), metadata={op_type="Reshape" op_name="Reshape_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg12.1 = f32[384,384]{1,0} parameter(12), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.123 = f32[384,384]{1,0} reshape(f32[384,384]{1,0} %arg12.1)
  %MatMul_5.2 = f32[1,64,384]{2,1,0} dot(f32[1,64,384]{2,1,0} %Reshape_3.1, f32[384,384]{1,0} %reshape.123), lhs_contracting_dims={2}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %MatMul_5.3 = f32[1,64,384]{2,1,0} transpose(f32[1,64,384]{2,1,0} %MatMul_5.2), dimensions={0,1,2}, metadata={op_type="BatchMatMulV2" op_name="MatMul_5" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg13.1 = f32[384]{0} parameter(13), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.124 = f32[384]{0} reshape(f32[384]{0} %arg13.1)
  %add_7.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.124), dimensions={2}, metadata={op_type="AddV2" op_name="add_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_7.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %MatMul_5.3, f32[1,64,384]{2,1,0} %add_7.2), metadata={op_type="AddV2" op_name="add_7" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_8.1 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %add.27, f32[1,64,384]{2,1,0} %add_7.3), metadata={op_type="AddV2" op_name="add_8" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.10 = f32[1,64,384]{2,1,0} convert(f32[1,64,384]{2,1,0} %add_8.1), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.11 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.12 = f32[] convert(f32[] %Mean_2.11), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.13 = f32[1,64]{1,0} reduce(f32[1,64,384]{2,1,0} %Mean_2.10, f32[] %Mean_2.12), dimensions={2}, to_apply=%Mean_2-reduction.5, metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.14 = s32[] constant(384), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.15 = f32[] convert(s32[] %Mean_2.14), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.16 = f32[1,64]{1,0} broadcast(f32[] %Mean_2.15), dimensions={}, metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.17 = f32[1,64]{1,0} divide(f32[1,64]{1,0} %Mean_2.13, f32[1,64]{1,0} %Mean_2.16), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.18 = f32[1,64]{1,0} convert(f32[1,64]{1,0} %Mean_2.17), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_2.19 = f32[1,64,1]{2,1,0} reshape(f32[1,64]{1,0} %Mean_2.18), metadata={op_type="Mean" op_name="Mean_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Mean_2.19), metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %sub_3.3), dimensions={0,1}, metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_3.5 = f32[1,64,384]{2,1,0} subtract(f32[1,64,384]{2,1,0} %add_8.1, f32[1,64,384]{2,1,0} %sub_3.4), metadata={op_type="Sub" op_name="sub_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Mean_2.19), metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %sub_2.3), dimensions={0,1}, metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %sub_2.5 = f32[1,64,384]{2,1,0} subtract(f32[1,64,384]{2,1,0} %add_8.1, f32[1,64,384]{2,1,0} %sub_2.4), metadata={op_type="Sub" op_name="sub_2" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Square_1.1 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %sub_2.5, f32[1,64,384]{2,1,0} %sub_2.5), metadata={op_type="Square" op_name="Square_1" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.10 = f32[1,64,384]{2,1,0} convert(f32[1,64,384]{2,1,0} %Square_1.1), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.11 = f32[] constant(0), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.12 = f32[] convert(f32[] %Mean_3.11), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.13 = f32[1,64]{1,0} reduce(f32[1,64,384]{2,1,0} %Mean_3.10, f32[] %Mean_3.12), dimensions={2}, to_apply=%Mean_3-reduction.6, metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.14 = s32[] constant(384), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.15 = f32[] convert(s32[] %Mean_3.14), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.16 = f32[1,64]{1,0} broadcast(f32[] %Mean_3.15), dimensions={}, metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.17 = f32[1,64]{1,0} divide(f32[1,64]{1,0} %Mean_3.13, f32[1,64]{1,0} %Mean_3.16), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.18 = f32[1,64]{1,0} convert(f32[1,64]{1,0} %Mean_3.17), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Mean_3.19 = f32[1,64,1]{2,1,0} reshape(f32[1,64]{1,0} %Mean_3.18), metadata={op_type="Mean" op_name="Mean_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_9.3 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="add_9" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_9.4 = f32[1,64,1]{2,1,0} broadcast(f32[] %add_9.3), dimensions={}, metadata={op_type="AddV2" op_name="add_9" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_9.5 = f32[1,64,1]{2,1,0} add(f32[1,64,1]{2,1,0} %Mean_3.19, f32[1,64,1]{2,1,0} %add_9.4), metadata={op_type="AddV2" op_name="add_9" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %Rsqrt_2.1 = f32[1,64,1]{2,1,0} rsqrt(f32[1,64,1]{2,1,0} %add_9.5), metadata={op_type="Rsqrt" op_name="Rsqrt_2"}
  %mul_3.3 = f32[1,64]{1,0} reshape(f32[1,64,1]{2,1,0} %Rsqrt_2.1), metadata={op_type="Mul" op_name="mul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_3.4 = f32[1,64,384]{2,1,0} broadcast(f32[1,64]{1,0} %mul_3.3), dimensions={0,1}, metadata={op_type="Mul" op_name="mul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_3.5 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %sub_3.5, f32[1,64,384]{2,1,0} %mul_3.4), metadata={op_type="Mul" op_name="mul_3" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg14.1 = f32[384]{0} parameter(14), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.125 = f32[384]{0} reshape(f32[384]{0} %arg14.1)
  %mul_4.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.125), dimensions={2}, metadata={op_type="Mul" op_name="mul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %mul_4.3 = f32[1,64,384]{2,1,0} multiply(f32[1,64,384]{2,1,0} %mul_3.5, f32[1,64,384]{2,1,0} %mul_4.2), metadata={op_type="Mul" op_name="mul_4" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg15.1 = f32[384]{0} parameter(15), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.126 = f32[384]{0} reshape(f32[384]{0} %arg15.1)
  %add_10.2 = f32[1,64,384]{2,1,0} broadcast(f32[384]{0} %reshape.126), dimensions={2}, metadata={op_type="AddV2" op_name="add_10" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %add_10.3 = f32[1,64,384]{2,1,0} add(f32[1,64,384]{2,1,0} %mul_4.3, f32[1,64,384]{2,1,0} %add_10.2), metadata={op_type="AddV2" op_name="add_10" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
  %arg16.1 = f32[384,384]{1,0} parameter(16), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.127 = f32[384,384]{1,0} reshape(f32[384,384]{1,0} %arg16.1)
  %MatMul_6.2 = f32[1,64,384]{2,1,0} dot(f32[1,64,384]{2,1,0} %add_10.3, f32[384,384]{1,0} %reshape.127), lhs_contracting_dims={2}, rhs_contracting_dims={0}, frontend_attributes={grad_x="false",grad_y="false"}, metadata={op_type="BatchMatMulV2" op_name="MatMul_6" source_file="<repo-root>/src/cuda-spirv/xla_hlo/.venv-tf/lib/python3.12/site-packages/tensorflow/python/framework/ops.py" source_line=1221}
